/* automatically generated by rust-bindgen 0.60.1 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const NULL: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 1;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const __bool_true_false_are_defined: u32 = 1;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut va_list, ...);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __vcrt_va_list_is_reference {
    pub _address: u8,
}
pub const __the_value: __vcrt_va_list_is_reference__bindgen_ty_1 = false;
pub type __vcrt_va_list_is_reference__bindgen_ty_1 = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __vcrt_assert_va_start_is_not_reference {
    pub _address: u8,
}
pub type size_t = ::std::os::raw::c_ulonglong;
pub type __vcrt_bool = bool;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize);
}
extern "C" {

pub const EVRSummaryType_VRSummaryType_FromDevice: EVRSummaryType = 1;
pub type EVRSummaryType = ::std::os::raw::c_int;
pub const EVRInputFilterCancelType_VRInputFilterCancel_Timers: EVRInputFilterCancelType = 0;
pub const EVRInputFilterCancelType_VRInputFilterCancel_Momentum: EVRInputFilterCancelType = 1;
pub type EVRInputFilterCancelType = ::std::os::raw::c_int;
pub const EVRInputStringBits_VRInputString_Hand: EVRInputStringBits = 1;
pub const EVRInputStringBits_VRInputString_ControllerType: EVRInputStringBits = 2;
pub const EVRInputStringBits_VRInputString_InputSource: EVRInputStringBits = 4;
pub const EVRInputStringBits_VRInputString_All: EVRInputStringBits = -1;
pub type EVRInputStringBits = ::std::os::raw::c_int;
pub const EIOBufferError_IOBuffer_Success: EIOBufferError = 0;
pub const EIOBufferError_IOBuffer_OperationFailed: EIOBufferError = 100;
pub const EIOBufferError_IOBuffer_InvalidHandle: EIOBufferError = 101;
pub const EIOBufferError_IOBuffer_InvalidArgument: EIOBufferError = 102;
pub const EIOBufferError_IOBuffer_PathExists: EIOBufferError = 103;
pub const EIOBufferError_IOBuffer_PathDoesNotExist: EIOBufferError = 104;
pub const EIOBufferError_IOBuffer_Permission: EIOBufferError = 105;
pub type EIOBufferError = ::std::os::raw::c_int;
pub const EIOBufferMode_IOBufferMode_Read: EIOBufferMode = 1;
pub const EIOBufferMode_IOBufferMode_Write: EIOBufferMode = 2;
pub const EIOBufferMode_IOBufferMode_Create: EIOBufferMode = 512;
pub type EIOBufferMode = ::std::os::raw::c_int;
pub type TrackedDeviceIndex_t = u32;
pub type VRNotificationId = u32;
pub type VROverlayHandle_t = u64;
pub type SpatialAnchorHandle_t = u32;
pub type glSharedTextureHandle_t = *mut ::std::os::raw::c_void;
pub type glInt_t = i32;
pub type glUInt_t = u32;
pub type SharedTextureHandle_t = u64;
pub type DriverId_t = u32;
pub type WebConsoleHandle_t = u64;
pub type DriverHandle_t = PropertyContainerHandle_t;
pub type BoneIndex_t = i32;
pub type TrackedCameraHandle_t = u64;
pub type ScreenshotHandle_t = u32;
pub type VRComponentProperties = u32;
pub type TextureID_t = i32;
pub type IOBufferHandle_t = u64;
pub use self::{
    ECollisionBoundsStyle as CollisionBoundsStyle_t, EColorSpace as ColorSpace,
    ETrackedDeviceClass as TrackedDeviceClass, ETrackedDeviceProperty as TrackedDeviceProperty,
    ETrackedPropertyError as TrackedPropertyError, ETrackingResult as HmdTrackingResult,
    ETrackingUniverseOrigin as TrackingUniverseOrigin, EVRCompositorError as VRCompositorError,
    EVREye as Hmd_Eye, EVRFirmwareError as VRFirmwareError, EVRInitError as HmdError,
    EVROverlayError as VROverlayError, EVRScreenshotError as VRScreenshotsError,
    EVRState as VRState_t, EVRSubmitFlags as VRSubmitFlags_t,
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdMatrix34_t {
    pub m: [[f32; 4usize]; 3usize],
}
#[test]
fn bindgen_test_layout_HmdMatrix34_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdMatrix34_t>(),
        48usize,
        concat!("Size of: ", stringify!(HmdMatrix34_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdMatrix34_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdMatrix34_t))
    );
    fn test_field_m() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdMatrix34_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdMatrix34_t),
                "::",
                stringify!(m)
            )
        );
    }
    test_field_m();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdMatrix33_t {
    pub m: [[f32; 3usize]; 3usize],
}
#[test]
fn bindgen_test_layout_HmdMatrix33_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdMatrix33_t>(),
        36usize,
        concat!("Size of: ", stringify!(HmdMatrix33_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdMatrix33_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdMatrix33_t))
    );
    fn test_field_m() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdMatrix33_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdMatrix33_t),
                "::",
                stringify!(m)
            )
        );
    }
    test_field_m();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdMatrix44_t {
    pub m: [[f32; 4usize]; 4usize],
}
#[test]
fn bindgen_test_layout_HmdMatrix44_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdMatrix44_t>(),
        64usize,
        concat!("Size of: ", stringify!(HmdMatrix44_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdMatrix44_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdMatrix44_t))
    );
    fn test_field_m() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdMatrix44_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdMatrix44_t),
                "::",
                stringify!(m)
            )
        );
    }
    test_field_m();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdVector3_t {
    pub v: [f32; 3usize],
}
#[test]
fn bindgen_test_layout_HmdVector3_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdVector3_t>(),
        12usize,
        concat!("Size of: ", stringify!(HmdVector3_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdVector3_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdVector3_t))
    );
    fn test_field_v() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdVector3_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdVector3_t),
                "::",
                stringify!(v)
            )
        );
    }
    test_field_v();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdVector4_t {
    pub v: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_HmdVector4_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdVector4_t>(),
        16usize,
        concat!("Size of: ", stringify!(HmdVector4_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdVector4_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdVector4_t))
    );
    fn test_field_v() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdVector4_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdVector4_t),
                "::",
                stringify!(v)
            )
        );
    }
    test_field_v();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdVector3d_t {
    pub v: [f64; 3usize],
}
#[test]
fn bindgen_test_layout_HmdVector3d_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdVector3d_t>(),
        24usize,
        concat!("Size of: ", stringify!(HmdVector3d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdVector3d_t>(),
        8usize,
        concat!("Alignment of ", stringify!(HmdVector3d_t))
    );
    fn test_field_v() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdVector3d_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdVector3d_t),
                "::",
                stringify!(v)
            )
        );
    }
    test_field_v();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdVector2_t {
    pub v: [f32; 2usize],
}
#[test]
fn bindgen_test_layout_HmdVector2_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdVector2_t>(),
        8usize,
        concat!("Size of: ", stringify!(HmdVector2_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdVector2_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdVector2_t))
    );
    fn test_field_v() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdVector2_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdVector2_t),
                "::",
                stringify!(v)
            )
        );
    }
    test_field_v();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdQuaternion_t {
    pub w: f64,
    pub x: f64,
    pub y: f64,
    pub z: f64,
}
#[test]
fn bindgen_test_layout_HmdQuaternion_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdQuaternion_t>(),
        32usize,
        concat!("Size of: ", stringify!(HmdQuaternion_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdQuaternion_t>(),
        8usize,
        concat!("Alignment of ", stringify!(HmdQuaternion_t))
    );
    fn test_field_w() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdQuaternion_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdQuaternion_t),
                "::",
                stringify!(w)
            )
        );
    }
    test_field_w();
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdQuaternion_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdQuaternion_t),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdQuaternion_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdQuaternion_t),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
    fn test_field_z() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdQuaternion_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdQuaternion_t),
                "::",
                stringify!(z)
            )
        );
    }
    test_field_z();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdQuaternionf_t {
    pub w: f32,
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[test]
fn bindgen_test_layout_HmdQuaternionf_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdQuaternionf_t>(),
        16usize,
        concat!("Size of: ", stringify!(HmdQuaternionf_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdQuaternionf_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdQuaternionf_t))
    );
    fn test_field_w() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdQuaternionf_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdQuaternionf_t),
                "::",
                stringify!(w)
            )
        );
    }
    test_field_w();
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdQuaternionf_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdQuaternionf_t),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdQuaternionf_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdQuaternionf_t),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
    fn test_field_z() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdQuaternionf_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdQuaternionf_t),
                "::",
                stringify!(z)
            )
        );
    }
    test_field_z();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdColor_t {
    pub r: f32,
    pub g: f32,
    pub b: f32,
    pub a: f32,
}
#[test]
fn bindgen_test_layout_HmdColor_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdColor_t>(),
        16usize,
        concat!("Size of: ", stringify!(HmdColor_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdColor_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdColor_t))
    );
    fn test_field_r() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdColor_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdColor_t),
                "::",
                stringify!(r)
            )
        );
    }
    test_field_r();
    fn test_field_g() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdColor_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdColor_t),
                "::",
                stringify!(g)
            )
        );
    }
    test_field_g();
    fn test_field_b() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdColor_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdColor_t),
                "::",
                stringify!(b)
            )
        );
    }
    test_field_b();
    fn test_field_a() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdColor_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdColor_t),
                "::",
                stringify!(a)
            )
        );
    }
    test_field_a();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdQuad_t {
    pub vCorners: [HmdVector3_t; 4usize],
}
#[test]
fn bindgen_test_layout_HmdQuad_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdQuad_t>(),
        48usize,
        concat!("Size of: ", stringify!(HmdQuad_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdQuad_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdQuad_t))
    );
    fn test_field_vCorners() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdQuad_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vCorners) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdQuad_t),
                "::",
                stringify!(vCorners)
            )
        );
    }
    test_field_vCorners();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HmdRect2_t {
    pub vTopLeft: HmdVector2_t,
    pub vBottomRight: HmdVector2_t,
}
#[test]
fn bindgen_test_layout_HmdRect2_t() {
    assert_eq!(
        ::std::mem::size_of::<HmdRect2_t>(),
        16usize,
        concat!("Size of: ", stringify!(HmdRect2_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HmdRect2_t>(),
        4usize,
        concat!("Alignment of ", stringify!(HmdRect2_t))
    );
    fn test_field_vTopLeft() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdRect2_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vTopLeft) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdRect2_t),
                "::",
                stringify!(vTopLeft)
            )
        );
    }
    test_field_vTopLeft();
    fn test_field_vBottomRight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HmdRect2_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vBottomRight) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(HmdRect2_t),
                "::",
                stringify!(vBottomRight)
            )
        );
    }
    test_field_vBottomRight();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DistortionCoordinates_t {
    pub rfRed: [f32; 2usize],
    pub rfGreen: [f32; 2usize],
    pub rfBlue: [f32; 2usize],
}
#[test]
fn bindgen_test_layout_DistortionCoordinates_t() {
    assert_eq!(
        ::std::mem::size_of::<DistortionCoordinates_t>(),
        24usize,
        concat!("Size of: ", stringify!(DistortionCoordinates_t))
    );
    assert_eq!(
        ::std::mem::align_of::<DistortionCoordinates_t>(),
        4usize,
        concat!("Alignment of ", stringify!(DistortionCoordinates_t))
    );
    fn test_field_rfRed() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DistortionCoordinates_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rfRed) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(DistortionCoordinates_t),
                "::",
                stringify!(rfRed)
            )
        );
    }
    test_field_rfRed();
    fn test_field_rfGreen() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DistortionCoordinates_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rfGreen) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(DistortionCoordinates_t),
                "::",
                stringify!(rfGreen)
            )
        );
    }
    test_field_rfGreen();
    fn test_field_rfBlue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DistortionCoordinates_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rfBlue) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(DistortionCoordinates_t),
                "::",
                stringify!(rfBlue)
            )
        );
    }
    test_field_rfBlue();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Texture_t {
    pub handle: *mut ::std::os::raw::c_void,
    pub eType: ETextureType,
    pub eColorSpace: EColorSpace,
}
#[test]
fn bindgen_test_layout_Texture_t() {
    assert_eq!(
        ::std::mem::size_of::<Texture_t>(),
        16usize,
        concat!("Size of: ", stringify!(Texture_t))
    );
    assert_eq!(
        ::std::mem::align_of::<Texture_t>(),
        8usize,
        concat!("Alignment of ", stringify!(Texture_t))
    );
    fn test_field_handle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Texture_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Texture_t),
                "::",
                stringify!(handle)
            )
        );
    }
    test_field_handle();
    fn test_field_eType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Texture_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eType) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(Texture_t),
                "::",
                stringify!(eType)
            )
        );
    }
    test_field_eType();
    fn test_field_eColorSpace() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Texture_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eColorSpace) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(Texture_t),
                "::",
                stringify!(eColorSpace)
            )
        );
    }
    test_field_eColorSpace();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TrackedDevicePose_t {
    pub mDeviceToAbsoluteTracking: HmdMatrix34_t,
    pub vVelocity: HmdVector3_t,
    pub vAngularVelocity: HmdVector3_t,
    pub eTrackingResult: ETrackingResult,
    pub bPoseIsValid: bool,
    pub bDeviceIsConnected: bool,
}
#[test]
fn bindgen_test_layout_TrackedDevicePose_t() {
    assert_eq!(
        ::std::mem::size_of::<TrackedDevicePose_t>(),
        80usize,
        concat!("Size of: ", stringify!(TrackedDevicePose_t))
    );
    assert_eq!(
        ::std::mem::align_of::<TrackedDevicePose_t>(),
        4usize,
        concat!("Alignment of ", stringify!(TrackedDevicePose_t))
    );
    fn test_field_mDeviceToAbsoluteTracking() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<TrackedDevicePose_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mDeviceToAbsoluteTracking) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(TrackedDevicePose_t),
                "::",
                stringify!(mDeviceToAbsoluteTracking)
            )
        );
    }
    test_field_mDeviceToAbsoluteTracking();
    fn test_field_vVelocity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<TrackedDevicePose_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vVelocity) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(TrackedDevicePose_t),
                "::",
                stringify!(vVelocity)
            )
        );
    }
    test_field_vVelocity();
    fn test_field_vAngularVelocity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<TrackedDevicePose_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vAngularVelocity) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(TrackedDevicePose_t),
                "::",
                stringify!(vAngularVelocity)
            )
        );
    }
    test_field_vAngularVelocity();
    fn test_field_eTrackingResult() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<TrackedDevicePose_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eTrackingResult) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(TrackedDevicePose_t),
                "::",
                stringify!(eTrackingResult)
            )
        );
    }
    test_field_eTrackingResult();
    fn test_field_bPoseIsValid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<TrackedDevicePose_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bPoseIsValid) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(TrackedDevicePose_t),
                "::",
                stringify!(bPoseIsValid)
            )
        );
    }
    test_field_bPoseIsValid();
    fn test_field_bDeviceIsConnected() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<TrackedDevicePose_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bDeviceIsConnected) as usize - ptr as usize
            },
            77usize,
            concat!(
                "Offset of field: ",
                stringify!(TrackedDevicePose_t),
                "::",
                stringify!(bDeviceIsConnected)
            )
        );
    }
    test_field_bDeviceIsConnected();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRTextureBounds_t {
    pub uMin: f32,
    pub vMin: f32,
    pub uMax: f32,
    pub vMax: f32,
}
#[test]
fn bindgen_test_layout_VRTextureBounds_t() {
    assert_eq!(
        ::std::mem::size_of::<VRTextureBounds_t>(),
        16usize,
        concat!("Size of: ", stringify!(VRTextureBounds_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRTextureBounds_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VRTextureBounds_t))
    );
    fn test_field_uMin() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureBounds_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).uMin) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureBounds_t),
                "::",
                stringify!(uMin)
            )
        );
    }
    test_field_uMin();
    fn test_field_vMin() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureBounds_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vMin) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureBounds_t),
                "::",
                stringify!(vMin)
            )
        );
    }
    test_field_vMin();
    fn test_field_uMax() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureBounds_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).uMax) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureBounds_t),
                "::",
                stringify!(uMax)
            )
        );
    }
    test_field_uMax();
    fn test_field_vMax() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureBounds_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vMax) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureBounds_t),
                "::",
                stringify!(vMax)
            )
        );
    }
    test_field_vMax();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRTextureWithPose_t {
    pub mDeviceToAbsoluteTracking: HmdMatrix34_t,
}
#[test]
fn bindgen_test_layout_VRTextureWithPose_t() {
    assert_eq!(
        ::std::mem::size_of::<VRTextureWithPose_t>(),
        48usize,
        concat!("Size of: ", stringify!(VRTextureWithPose_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRTextureWithPose_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VRTextureWithPose_t))
    );
    fn test_field_mDeviceToAbsoluteTracking() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureWithPose_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mDeviceToAbsoluteTracking) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureWithPose_t),
                "::",
                stringify!(mDeviceToAbsoluteTracking)
            )
        );
    }
    test_field_mDeviceToAbsoluteTracking();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRTextureDepthInfo_t {
    pub handle: *mut ::std::os::raw::c_void,
    pub mProjection: HmdMatrix44_t,
    pub vRange: HmdVector2_t,
}
#[test]
fn bindgen_test_layout_VRTextureDepthInfo_t() {
    assert_eq!(
        ::std::mem::size_of::<VRTextureDepthInfo_t>(),
        80usize,
        concat!("Size of: ", stringify!(VRTextureDepthInfo_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRTextureDepthInfo_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VRTextureDepthInfo_t))
    );
    fn test_field_handle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureDepthInfo_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureDepthInfo_t),
                "::",
                stringify!(handle)
            )
        );
    }
    test_field_handle();
    fn test_field_mProjection() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureDepthInfo_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mProjection) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureDepthInfo_t),
                "::",
                stringify!(mProjection)
            )
        );
    }
    test_field_mProjection();
    fn test_field_vRange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureDepthInfo_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vRange) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureDepthInfo_t),
                "::",
                stringify!(vRange)
            )
        );
    }
    test_field_vRange();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRTextureWithDepth_t {
    pub depth: VRTextureDepthInfo_t,
}
#[test]
fn bindgen_test_layout_VRTextureWithDepth_t() {
    assert_eq!(
        ::std::mem::size_of::<VRTextureWithDepth_t>(),
        80usize,
        concat!("Size of: ", stringify!(VRTextureWithDepth_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRTextureWithDepth_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VRTextureWithDepth_t))
    );
    fn test_field_depth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureWithDepth_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureWithDepth_t),
                "::",
                stringify!(depth)
            )
        );
    }
    test_field_depth();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRTextureWithPoseAndDepth_t {
    pub depth: VRTextureDepthInfo_t,
}
#[test]
fn bindgen_test_layout_VRTextureWithPoseAndDepth_t() {
    assert_eq!(
        ::std::mem::size_of::<VRTextureWithPoseAndDepth_t>(),
        80usize,
        concat!("Size of: ", stringify!(VRTextureWithPoseAndDepth_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRTextureWithPoseAndDepth_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VRTextureWithPoseAndDepth_t))
    );
    fn test_field_depth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRTextureWithPoseAndDepth_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRTextureWithPoseAndDepth_t),
                "::",
                stringify!(depth)
            )
        );
    }
    test_field_depth();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRVulkanTextureData_t {
    pub m_nImage: u64,
    pub m_pDevice: *mut VkDevice_T,
    pub m_pPhysicalDevice: *mut VkPhysicalDevice_T,
    pub m_pInstance: *mut VkInstance_T,
    pub m_pQueue: *mut VkQueue_T,
    pub m_nQueueFamilyIndex: u32,
    pub m_nWidth: u32,
    pub m_nHeight: u32,
    pub m_nFormat: u32,
    pub m_nSampleCount: u32,
}
#[test]
fn bindgen_test_layout_VRVulkanTextureData_t() {
    assert_eq!(
        ::std::mem::size_of::<VRVulkanTextureData_t>(),
        64usize,
        concat!("Size of: ", stringify!(VRVulkanTextureData_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRVulkanTextureData_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VRVulkanTextureData_t))
    );
    fn test_field_m_nImage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nImage) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_nImage)
            )
        );
    }
    test_field_m_nImage();
    fn test_field_m_pDevice() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pDevice) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_pDevice)
            )
        );
    }
    test_field_m_pDevice();
    fn test_field_m_pPhysicalDevice() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pPhysicalDevice) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_pPhysicalDevice)
            )
        );
    }
    test_field_m_pPhysicalDevice();
    fn test_field_m_pInstance() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pInstance) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_pInstance)
            )
        );
    }
    test_field_m_pInstance();
    fn test_field_m_pQueue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pQueue) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_pQueue)
            )
        );
    }
    test_field_m_pQueue();
    fn test_field_m_nQueueFamilyIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nQueueFamilyIndex) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_nQueueFamilyIndex)
            )
        );
    }
    test_field_m_nQueueFamilyIndex();
    fn test_field_m_nWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nWidth) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_nWidth)
            )
        );
    }
    test_field_m_nWidth();
    fn test_field_m_nHeight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nHeight) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_nHeight)
            )
        );
    }
    test_field_m_nHeight();
    fn test_field_m_nFormat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nFormat) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_nFormat)
            )
        );
    }
    test_field_m_nFormat();
    fn test_field_m_nSampleCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRVulkanTextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nSampleCount) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VRVulkanTextureData_t),
                "::",
                stringify!(m_nSampleCount)
            )
        );
    }
    test_field_m_nSampleCount();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct D3D12TextureData_t {
    pub m_pResource: *mut ID3D12Resource,
    pub m_pCommandQueue: *mut ID3D12CommandQueue,
    pub m_nNodeMask: u32,
}
#[test]
fn bindgen_test_layout_D3D12TextureData_t() {
    assert_eq!(
        ::std::mem::size_of::<D3D12TextureData_t>(),
        24usize,
        concat!("Size of: ", stringify!(D3D12TextureData_t))
    );
    assert_eq!(
        ::std::mem::align_of::<D3D12TextureData_t>(),
        8usize,
        concat!("Alignment of ", stringify!(D3D12TextureData_t))
    );
    fn test_field_m_pResource() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<D3D12TextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pResource) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(D3D12TextureData_t),
                "::",
                stringify!(m_pResource)
            )
        );
    }
    test_field_m_pResource();
    fn test_field_m_pCommandQueue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<D3D12TextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pCommandQueue) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(D3D12TextureData_t),
                "::",
                stringify!(m_pCommandQueue)
            )
        );
    }
    test_field_m_pCommandQueue();
    fn test_field_m_nNodeMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<D3D12TextureData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNodeMask) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(D3D12TextureData_t),
                "::",
                stringify!(m_nNodeMask)
            )
        );
    }
    test_field_m_nNodeMask();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Controller_t {
    pub button: u32,
}
#[test]
fn bindgen_test_layout_VREvent_Controller_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Controller_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_Controller_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Controller_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_Controller_t))
    );
    fn test_field_button() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Controller_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).button) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Controller_t),
                "::",
                stringify!(button)
            )
        );
    }
    test_field_button();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Mouse_t {
    pub x: f32,
    pub y: f32,
    pub button: u32,
}
#[test]
fn bindgen_test_layout_VREvent_Mouse_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Mouse_t>(),
        12usize,
        concat!("Size of: ", stringify!(VREvent_Mouse_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Mouse_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_Mouse_t))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Mouse_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Mouse_t),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Mouse_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Mouse_t),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
    fn test_field_button() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Mouse_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).button) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Mouse_t),
                "::",
                stringify!(button)
            )
        );
    }
    test_field_button();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Scroll_t {
    pub xdelta: f32,
    pub ydelta: f32,
    pub unused: u32,
    pub viewportscale: f32,
}
#[test]
fn bindgen_test_layout_VREvent_Scroll_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Scroll_t>(),
        16usize,
        concat!("Size of: ", stringify!(VREvent_Scroll_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Scroll_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_Scroll_t))
    );
    fn test_field_xdelta() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Scroll_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xdelta) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Scroll_t),
                "::",
                stringify!(xdelta)
            )
        );
    }
    test_field_xdelta();
    fn test_field_ydelta() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Scroll_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ydelta) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Scroll_t),
                "::",
                stringify!(ydelta)
            )
        );
    }
    test_field_ydelta();
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Scroll_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Scroll_t),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
    fn test_field_viewportscale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Scroll_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).viewportscale) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Scroll_t),
                "::",
                stringify!(viewportscale)
            )
        );
    }
    test_field_viewportscale();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_TouchPadMove_t {
    pub bFingerDown: bool,
    pub flSecondsFingerDown: f32,
    pub fValueXFirst: f32,
    pub fValueYFirst: f32,
    pub fValueXRaw: f32,
    pub fValueYRaw: f32,
}
#[test]
fn bindgen_test_layout_VREvent_TouchPadMove_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_TouchPadMove_t>(),
        24usize,
        concat!("Size of: ", stringify!(VREvent_TouchPadMove_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_TouchPadMove_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_TouchPadMove_t))
    );
    fn test_field_bFingerDown() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_TouchPadMove_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bFingerDown) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_TouchPadMove_t),
                "::",
                stringify!(bFingerDown)
            )
        );
    }
    test_field_bFingerDown();
    fn test_field_flSecondsFingerDown() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_TouchPadMove_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flSecondsFingerDown) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_TouchPadMove_t),
                "::",
                stringify!(flSecondsFingerDown)
            )
        );
    }
    test_field_flSecondsFingerDown();
    fn test_field_fValueXFirst() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_TouchPadMove_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fValueXFirst) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_TouchPadMove_t),
                "::",
                stringify!(fValueXFirst)
            )
        );
    }
    test_field_fValueXFirst();
    fn test_field_fValueYFirst() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_TouchPadMove_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fValueYFirst) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_TouchPadMove_t),
                "::",
                stringify!(fValueYFirst)
            )
        );
    }
    test_field_fValueYFirst();
    fn test_field_fValueXRaw() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_TouchPadMove_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fValueXRaw) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_TouchPadMove_t),
                "::",
                stringify!(fValueXRaw)
            )
        );
    }
    test_field_fValueXRaw();
    fn test_field_fValueYRaw() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_TouchPadMove_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fValueYRaw) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_TouchPadMove_t),
                "::",
                stringify!(fValueYRaw)
            )
        );
    }
    test_field_fValueYRaw();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Notification_t {
    pub ulUserValue: u64,
    pub notificationId: u32,
}
#[test]
fn bindgen_test_layout_VREvent_Notification_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Notification_t>(),
        16usize,
        concat!("Size of: ", stringify!(VREvent_Notification_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Notification_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_Notification_t))
    );
    fn test_field_ulUserValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Notification_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ulUserValue) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Notification_t),
                "::",
                stringify!(ulUserValue)
            )
        );
    }
    test_field_ulUserValue();
    fn test_field_notificationId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Notification_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).notificationId) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Notification_t),
                "::",
                stringify!(notificationId)
            )
        );
    }
    test_field_notificationId();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Process_t {
    pub pid: u32,
    pub oldPid: u32,
    pub bForced: bool,
    pub bConnectionLost: bool,
}
#[test]
fn bindgen_test_layout_VREvent_Process_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Process_t>(),
        12usize,
        concat!("Size of: ", stringify!(VREvent_Process_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Process_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_Process_t))
    );
    fn test_field_pid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Process_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Process_t),
                "::",
                stringify!(pid)
            )
        );
    }
    test_field_pid();
    fn test_field_oldPid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Process_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).oldPid) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Process_t),
                "::",
                stringify!(oldPid)
            )
        );
    }
    test_field_oldPid();
    fn test_field_bForced() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Process_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bForced) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Process_t),
                "::",
                stringify!(bForced)
            )
        );
    }
    test_field_bForced();
    fn test_field_bConnectionLost() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Process_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bConnectionLost) as usize - ptr as usize
            },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Process_t),
                "::",
                stringify!(bConnectionLost)
            )
        );
    }
    test_field_bConnectionLost();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Overlay_t {
    pub overlayHandle: u64,
    pub devicePath: u64,
}
#[test]
fn bindgen_test_layout_VREvent_Overlay_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Overlay_t>(),
        16usize,
        concat!("Size of: ", stringify!(VREvent_Overlay_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Overlay_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_Overlay_t))
    );
    fn test_field_overlayHandle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Overlay_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).overlayHandle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Overlay_t),
                "::",
                stringify!(overlayHandle)
            )
        );
    }
    test_field_overlayHandle();
    fn test_field_devicePath() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Overlay_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).devicePath) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Overlay_t),
                "::",
                stringify!(devicePath)
            )
        );
    }
    test_field_devicePath();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Status_t {
    pub statusState: u32,
}
#[test]
fn bindgen_test_layout_VREvent_Status_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Status_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_Status_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Status_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_Status_t))
    );
    fn test_field_statusState() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Status_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).statusState) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Status_t),
                "::",
                stringify!(statusState)
            )
        );
    }
    test_field_statusState();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Keyboard_t {
    pub cNewInput: [::std::os::raw::c_char; 8usize],
    pub uUserValue: u64,
}
#[test]
fn bindgen_test_layout_VREvent_Keyboard_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Keyboard_t>(),
        16usize,
        concat!("Size of: ", stringify!(VREvent_Keyboard_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Keyboard_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_Keyboard_t))
    );
    fn test_field_cNewInput() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Keyboard_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cNewInput) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Keyboard_t),
                "::",
                stringify!(cNewInput)
            )
        );
    }
    test_field_cNewInput();
    fn test_field_uUserValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Keyboard_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).uUserValue) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Keyboard_t),
                "::",
                stringify!(uUserValue)
            )
        );
    }
    test_field_uUserValue();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Ipd_t {
    pub ipdMeters: f32,
}
#[test]
fn bindgen_test_layout_VREvent_Ipd_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Ipd_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_Ipd_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Ipd_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_Ipd_t))
    );
    fn test_field_ipdMeters() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Ipd_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ipdMeters) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Ipd_t),
                "::",
                stringify!(ipdMeters)
            )
        );
    }
    test_field_ipdMeters();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Chaperone_t {
    pub m_nPreviousUniverse: u64,
    pub m_nCurrentUniverse: u64,
}
#[test]
fn bindgen_test_layout_VREvent_Chaperone_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Chaperone_t>(),
        16usize,
        concat!("Size of: ", stringify!(VREvent_Chaperone_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Chaperone_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_Chaperone_t))
    );
    fn test_field_m_nPreviousUniverse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Chaperone_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nPreviousUniverse) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Chaperone_t),
                "::",
                stringify!(m_nPreviousUniverse)
            )
        );
    }
    test_field_m_nPreviousUniverse();
    fn test_field_m_nCurrentUniverse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Chaperone_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nCurrentUniverse) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Chaperone_t),
                "::",
                stringify!(m_nCurrentUniverse)
            )
        );
    }
    test_field_m_nCurrentUniverse();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Reserved_t {
    pub reserved0: u64,
    pub reserved1: u64,
    pub reserved2: u64,
    pub reserved3: u64,
    pub reserved4: u64,
    pub reserved5: u64,
}
#[test]
fn bindgen_test_layout_VREvent_Reserved_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Reserved_t>(),
        48usize,
        concat!("Size of: ", stringify!(VREvent_Reserved_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Reserved_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_Reserved_t))
    );
    fn test_field_reserved0() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Reserved_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved0) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Reserved_t),
                "::",
                stringify!(reserved0)
            )
        );
    }
    test_field_reserved0();
    fn test_field_reserved1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Reserved_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Reserved_t),
                "::",
                stringify!(reserved1)
            )
        );
    }
    test_field_reserved1();
    fn test_field_reserved2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Reserved_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Reserved_t),
                "::",
                stringify!(reserved2)
            )
        );
    }
    test_field_reserved2();
    fn test_field_reserved3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Reserved_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Reserved_t),
                "::",
                stringify!(reserved3)
            )
        );
    }
    test_field_reserved3();
    fn test_field_reserved4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Reserved_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved4) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Reserved_t),
                "::",
                stringify!(reserved4)
            )
        );
    }
    test_field_reserved4();
    fn test_field_reserved5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Reserved_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved5) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Reserved_t),
                "::",
                stringify!(reserved5)
            )
        );
    }
    test_field_reserved5();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_PerformanceTest_t {
    pub m_nFidelityLevel: u32,
}
#[test]
fn bindgen_test_layout_VREvent_PerformanceTest_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_PerformanceTest_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_PerformanceTest_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_PerformanceTest_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_PerformanceTest_t))
    );
    fn test_field_m_nFidelityLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_PerformanceTest_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nFidelityLevel) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_PerformanceTest_t),
                "::",
                stringify!(m_nFidelityLevel)
            )
        );
    }
    test_field_m_nFidelityLevel();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_SeatedZeroPoseReset_t {
    pub bResetBySystemMenu: bool,
}
#[test]
fn bindgen_test_layout_VREvent_SeatedZeroPoseReset_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_SeatedZeroPoseReset_t>(),
        1usize,
        concat!("Size of: ", stringify!(VREvent_SeatedZeroPoseReset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_SeatedZeroPoseReset_t>(),
        1usize,
        concat!("Alignment of ", stringify!(VREvent_SeatedZeroPoseReset_t))
    );
    fn test_field_bResetBySystemMenu() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_SeatedZeroPoseReset_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bResetBySystemMenu) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_SeatedZeroPoseReset_t),
                "::",
                stringify!(bResetBySystemMenu)
            )
        );
    }
    test_field_bResetBySystemMenu();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Screenshot_t {
    pub handle: u32,
    pub type_: u32,
}
#[test]
fn bindgen_test_layout_VREvent_Screenshot_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Screenshot_t>(),
        8usize,
        concat!("Size of: ", stringify!(VREvent_Screenshot_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Screenshot_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_Screenshot_t))
    );
    fn test_field_handle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Screenshot_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Screenshot_t),
                "::",
                stringify!(handle)
            )
        );
    }
    test_field_handle();
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Screenshot_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Screenshot_t),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_ScreenshotProgress_t {
    pub progress: f32,
}
#[test]
fn bindgen_test_layout_VREvent_ScreenshotProgress_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_ScreenshotProgress_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_ScreenshotProgress_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_ScreenshotProgress_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_ScreenshotProgress_t))
    );
    fn test_field_progress() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ScreenshotProgress_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).progress) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ScreenshotProgress_t),
                "::",
                stringify!(progress)
            )
        );
    }
    test_field_progress();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_ApplicationLaunch_t {
    pub pid: u32,
    pub unArgsHandle: u32,
}
#[test]
fn bindgen_test_layout_VREvent_ApplicationLaunch_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_ApplicationLaunch_t>(),
        8usize,
        concat!("Size of: ", stringify!(VREvent_ApplicationLaunch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_ApplicationLaunch_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_ApplicationLaunch_t))
    );
    fn test_field_pid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ApplicationLaunch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ApplicationLaunch_t),
                "::",
                stringify!(pid)
            )
        );
    }
    test_field_pid();
    fn test_field_unArgsHandle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ApplicationLaunch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unArgsHandle) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ApplicationLaunch_t),
                "::",
                stringify!(unArgsHandle)
            )
        );
    }
    test_field_unArgsHandle();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_EditingCameraSurface_t {
    pub overlayHandle: u64,
    pub nVisualMode: u32,
}
#[test]
fn bindgen_test_layout_VREvent_EditingCameraSurface_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_EditingCameraSurface_t>(),
        16usize,
        concat!("Size of: ", stringify!(VREvent_EditingCameraSurface_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_EditingCameraSurface_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_EditingCameraSurface_t))
    );
    fn test_field_overlayHandle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_EditingCameraSurface_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).overlayHandle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_EditingCameraSurface_t),
                "::",
                stringify!(overlayHandle)
            )
        );
    }
    test_field_overlayHandle();
    fn test_field_nVisualMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_EditingCameraSurface_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nVisualMode) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_EditingCameraSurface_t),
                "::",
                stringify!(nVisualMode)
            )
        );
    }
    test_field_nVisualMode();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_MessageOverlay_t {
    pub unVRMessageOverlayResponse: u32,
}
#[test]
fn bindgen_test_layout_VREvent_MessageOverlay_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_MessageOverlay_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_MessageOverlay_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_MessageOverlay_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_MessageOverlay_t))
    );
    fn test_field_unVRMessageOverlayResponse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_MessageOverlay_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unVRMessageOverlayResponse) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_MessageOverlay_t),
                "::",
                stringify!(unVRMessageOverlayResponse)
            )
        );
    }
    test_field_unVRMessageOverlayResponse();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_Property_t {
    pub container: PropertyContainerHandle_t,
    pub prop: ETrackedDeviceProperty,
}
#[test]
fn bindgen_test_layout_VREvent_Property_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Property_t>(),
        16usize,
        concat!("Size of: ", stringify!(VREvent_Property_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Property_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_Property_t))
    );
    fn test_field_container() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Property_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).container) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Property_t),
                "::",
                stringify!(container)
            )
        );
    }
    test_field_container();
    fn test_field_prop() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Property_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prop) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Property_t),
                "::",
                stringify!(prop)
            )
        );
    }
    test_field_prop();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_DualAnalog_t {
    pub x: f32,
    pub y: f32,
    pub transformedX: f32,
    pub transformedY: f32,
    pub which: EDualAnalogWhich,
}
#[test]
fn bindgen_test_layout_VREvent_DualAnalog_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_DualAnalog_t>(),
        20usize,
        concat!("Size of: ", stringify!(VREvent_DualAnalog_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_DualAnalog_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_DualAnalog_t))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_DualAnalog_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_DualAnalog_t),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_DualAnalog_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_DualAnalog_t),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
    fn test_field_transformedX() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_DualAnalog_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transformedX) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_DualAnalog_t),
                "::",
                stringify!(transformedX)
            )
        );
    }
    test_field_transformedX();
    fn test_field_transformedY() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_DualAnalog_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transformedY) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_DualAnalog_t),
                "::",
                stringify!(transformedY)
            )
        );
    }
    test_field_transformedY();
    fn test_field_which() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_DualAnalog_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).which) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_DualAnalog_t),
                "::",
                stringify!(which)
            )
        );
    }
    test_field_which();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_HapticVibration_t {
    pub containerHandle: u64,
    pub componentHandle: u64,
    pub fDurationSeconds: f32,
    pub fFrequency: f32,
    pub fAmplitude: f32,
}
#[test]
fn bindgen_test_layout_VREvent_HapticVibration_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_HapticVibration_t>(),
        32usize,
        concat!("Size of: ", stringify!(VREvent_HapticVibration_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_HapticVibration_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_HapticVibration_t))
    );
    fn test_field_containerHandle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_HapticVibration_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).containerHandle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_HapticVibration_t),
                "::",
                stringify!(containerHandle)
            )
        );
    }
    test_field_containerHandle();
    fn test_field_componentHandle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_HapticVibration_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).componentHandle) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_HapticVibration_t),
                "::",
                stringify!(componentHandle)
            )
        );
    }
    test_field_componentHandle();
    fn test_field_fDurationSeconds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_HapticVibration_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fDurationSeconds) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_HapticVibration_t),
                "::",
                stringify!(fDurationSeconds)
            )
        );
    }
    test_field_fDurationSeconds();
    fn test_field_fFrequency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_HapticVibration_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fFrequency) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_HapticVibration_t),
                "::",
                stringify!(fFrequency)
            )
        );
    }
    test_field_fFrequency();
    fn test_field_fAmplitude() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_HapticVibration_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fAmplitude) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_HapticVibration_t),
                "::",
                stringify!(fAmplitude)
            )
        );
    }
    test_field_fAmplitude();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_WebConsole_t {
    pub webConsoleHandle: WebConsoleHandle_t,
}
#[test]
fn bindgen_test_layout_VREvent_WebConsole_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_WebConsole_t>(),
        8usize,
        concat!("Size of: ", stringify!(VREvent_WebConsole_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_WebConsole_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_WebConsole_t))
    );
    fn test_field_webConsoleHandle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_WebConsole_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).webConsoleHandle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_WebConsole_t),
                "::",
                stringify!(webConsoleHandle)
            )
        );
    }
    test_field_webConsoleHandle();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_InputBindingLoad_t {
    pub ulAppContainer: PropertyContainerHandle_t,
    pub pathMessage: u64,
    pub pathUrl: u64,
    pub pathControllerType: u64,
}
#[test]
fn bindgen_test_layout_VREvent_InputBindingLoad_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_InputBindingLoad_t>(),
        32usize,
        concat!("Size of: ", stringify!(VREvent_InputBindingLoad_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_InputBindingLoad_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_InputBindingLoad_t))
    );
    fn test_field_ulAppContainer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_InputBindingLoad_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ulAppContainer) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_InputBindingLoad_t),
                "::",
                stringify!(ulAppContainer)
            )
        );
    }
    test_field_ulAppContainer();
    fn test_field_pathMessage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_InputBindingLoad_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathMessage) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_InputBindingLoad_t),
                "::",
                stringify!(pathMessage)
            )
        );
    }
    test_field_pathMessage();
    fn test_field_pathUrl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_InputBindingLoad_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathUrl) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_InputBindingLoad_t),
                "::",
                stringify!(pathUrl)
            )
        );
    }
    test_field_pathUrl();
    fn test_field_pathControllerType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_InputBindingLoad_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathControllerType) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_InputBindingLoad_t),
                "::",
                stringify!(pathControllerType)
            )
        );
    }
    test_field_pathControllerType();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_InputActionManifestLoad_t {
    pub pathAppKey: u64,
    pub pathMessage: u64,
    pub pathMessageParam: u64,
    pub pathManifestPath: u64,
}
#[test]
fn bindgen_test_layout_VREvent_InputActionManifestLoad_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_InputActionManifestLoad_t>(),
        32usize,
        concat!("Size of: ", stringify!(VREvent_InputActionManifestLoad_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_InputActionManifestLoad_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(VREvent_InputActionManifestLoad_t)
        )
    );
    fn test_field_pathAppKey() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_InputActionManifestLoad_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathAppKey) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_InputActionManifestLoad_t),
                "::",
                stringify!(pathAppKey)
            )
        );
    }
    test_field_pathAppKey();
    fn test_field_pathMessage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_InputActionManifestLoad_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathMessage) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_InputActionManifestLoad_t),
                "::",
                stringify!(pathMessage)
            )
        );
    }
    test_field_pathMessage();
    fn test_field_pathMessageParam() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_InputActionManifestLoad_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathMessageParam) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_InputActionManifestLoad_t),
                "::",
                stringify!(pathMessageParam)
            )
        );
    }
    test_field_pathMessageParam();
    fn test_field_pathManifestPath() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_InputActionManifestLoad_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathManifestPath) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_InputActionManifestLoad_t),
                "::",
                stringify!(pathManifestPath)
            )
        );
    }
    test_field_pathManifestPath();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_SpatialAnchor_t {
    pub unHandle: SpatialAnchorHandle_t,
}
#[test]
fn bindgen_test_layout_VREvent_SpatialAnchor_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_SpatialAnchor_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_SpatialAnchor_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_SpatialAnchor_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_SpatialAnchor_t))
    );
    fn test_field_unHandle() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_SpatialAnchor_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unHandle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_SpatialAnchor_t),
                "::",
                stringify!(unHandle)
            )
        );
    }
    test_field_unHandle();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_ProgressUpdate_t {
    pub ulApplicationPropertyContainer: u64,
    pub pathDevice: u64,
    pub pathInputSource: u64,
    pub pathProgressAction: u64,
    pub pathIcon: u64,
    pub fProgress: f32,
}
#[test]
fn bindgen_test_layout_VREvent_ProgressUpdate_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_ProgressUpdate_t>(),
        48usize,
        concat!("Size of: ", stringify!(VREvent_ProgressUpdate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_ProgressUpdate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_ProgressUpdate_t))
    );
    fn test_field_ulApplicationPropertyContainer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ProgressUpdate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ulApplicationPropertyContainer) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ProgressUpdate_t),
                "::",
                stringify!(ulApplicationPropertyContainer)
            )
        );
    }
    test_field_ulApplicationPropertyContainer();
    fn test_field_pathDevice() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ProgressUpdate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathDevice) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ProgressUpdate_t),
                "::",
                stringify!(pathDevice)
            )
        );
    }
    test_field_pathDevice();
    fn test_field_pathInputSource() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ProgressUpdate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathInputSource) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ProgressUpdate_t),
                "::",
                stringify!(pathInputSource)
            )
        );
    }
    test_field_pathInputSource();
    fn test_field_pathProgressAction() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ProgressUpdate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathProgressAction) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ProgressUpdate_t),
                "::",
                stringify!(pathProgressAction)
            )
        );
    }
    test_field_pathProgressAction();
    fn test_field_pathIcon() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ProgressUpdate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pathIcon) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ProgressUpdate_t),
                "::",
                stringify!(pathIcon)
            )
        );
    }
    test_field_pathIcon();
    fn test_field_fProgress() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ProgressUpdate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fProgress) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ProgressUpdate_t),
                "::",
                stringify!(fProgress)
            )
        );
    }
    test_field_fProgress();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_ShowUI_t {
    pub eType: EShowUIType,
}
#[test]
fn bindgen_test_layout_VREvent_ShowUI_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_ShowUI_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_ShowUI_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_ShowUI_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_ShowUI_t))
    );
    fn test_field_eType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ShowUI_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ShowUI_t),
                "::",
                stringify!(eType)
            )
        );
    }
    test_field_eType();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_ShowDevTools_t {
    pub nBrowserIdentifier: i32,
}
#[test]
fn bindgen_test_layout_VREvent_ShowDevTools_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_ShowDevTools_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_ShowDevTools_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_ShowDevTools_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_ShowDevTools_t))
    );
    fn test_field_nBrowserIdentifier() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_ShowDevTools_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nBrowserIdentifier) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_ShowDevTools_t),
                "::",
                stringify!(nBrowserIdentifier)
            )
        );
    }
    test_field_nBrowserIdentifier();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VREvent_HDCPError_t {
    pub eCode: EHDCPError,
}
#[test]
fn bindgen_test_layout_VREvent_HDCPError_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_HDCPError_t>(),
        4usize,
        concat!("Size of: ", stringify!(VREvent_HDCPError_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_HDCPError_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VREvent_HDCPError_t))
    );
    fn test_field_eCode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_HDCPError_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eCode) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_HDCPError_t),
                "::",
                stringify!(eCode)
            )
        );
    }
    test_field_eCode();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HiddenAreaMesh_t {
    pub pVertexData: *mut HmdVector2_t,
    pub unTriangleCount: u32,
}
#[test]
fn bindgen_test_layout_HiddenAreaMesh_t() {
    assert_eq!(
        ::std::mem::size_of::<HiddenAreaMesh_t>(),
        16usize,
        concat!("Size of: ", stringify!(HiddenAreaMesh_t))
    );
    assert_eq!(
        ::std::mem::align_of::<HiddenAreaMesh_t>(),
        8usize,
        concat!("Alignment of ", stringify!(HiddenAreaMesh_t))
    );
    fn test_field_pVertexData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HiddenAreaMesh_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pVertexData) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(HiddenAreaMesh_t),
                "::",
                stringify!(pVertexData)
            )
        );
    }
    test_field_pVertexData();
    fn test_field_unTriangleCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<HiddenAreaMesh_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unTriangleCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(HiddenAreaMesh_t),
                "::",
                stringify!(unTriangleCount)
            )
        );
    }
    test_field_unTriangleCount();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRControllerAxis_t {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_VRControllerAxis_t() {
    assert_eq!(
        ::std::mem::size_of::<VRControllerAxis_t>(),
        8usize,
        concat!("Size of: ", stringify!(VRControllerAxis_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRControllerAxis_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VRControllerAxis_t))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRControllerAxis_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRControllerAxis_t),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRControllerAxis_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VRControllerAxis_t),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRControllerState_t {
    pub unPacketNum: u32,
    pub ulButtonPressed: u64,
    pub ulButtonTouched: u64,
    pub rAxis: [VRControllerAxis_t; 5usize],
}
#[test]
fn bindgen_test_layout_VRControllerState_t() {
    assert_eq!(
        ::std::mem::size_of::<VRControllerState_t>(),
        64usize,
        concat!("Size of: ", stringify!(VRControllerState_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRControllerState_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VRControllerState_t))
    );
    fn test_field_unPacketNum() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRControllerState_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unPacketNum) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRControllerState_t),
                "::",
                stringify!(unPacketNum)
            )
        );
    }
    test_field_unPacketNum();
    fn test_field_ulButtonPressed() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRControllerState_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ulButtonPressed) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VRControllerState_t),
                "::",
                stringify!(ulButtonPressed)
            )
        );
    }
    test_field_ulButtonPressed();
    fn test_field_ulButtonTouched() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRControllerState_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ulButtonTouched) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VRControllerState_t),
                "::",
                stringify!(ulButtonTouched)
            )
        );
    }
    test_field_ulButtonTouched();
    fn test_field_rAxis() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRControllerState_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rAxis) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VRControllerState_t),
                "::",
                stringify!(rAxis)
            )
        );
    }
    test_field_rAxis();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Compositor_OverlaySettings {
    pub size: u32,
    pub curved: bool,
    pub antialias: bool,
    pub scale: f32,
    pub distance: f32,
    pub alpha: f32,
    pub uOffset: f32,
    pub vOffset: f32,
    pub uScale: f32,
    pub vScale: f32,
    pub gridDivs: f32,
    pub gridWidth: f32,
    pub gridScale: f32,
    pub transform: HmdMatrix44_t,
}
#[test]
fn bindgen_test_layout_Compositor_OverlaySettings() {
    assert_eq!(
        ::std::mem::size_of::<Compositor_OverlaySettings>(),
        112usize,
        concat!("Size of: ", stringify!(Compositor_OverlaySettings))
    );
    assert_eq!(
        ::std::mem::align_of::<Compositor_OverlaySettings>(),
        4usize,
        concat!("Alignment of ", stringify!(Compositor_OverlaySettings))
    );
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
    fn test_field_curved() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).curved) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(curved)
            )
        );
    }
    test_field_curved();
    fn test_field_antialias() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).antialias) as usize - ptr as usize
            },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(antialias)
            )
        );
    }
    test_field_antialias();
    fn test_field_scale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(scale)
            )
        );
    }
    test_field_scale();
    fn test_field_distance() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(distance)
            )
        );
    }
    test_field_distance();
    fn test_field_alpha() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alpha) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(alpha)
            )
        );
    }
    test_field_alpha();
    fn test_field_uOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).uOffset) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(uOffset)
            )
        );
    }
    test_field_uOffset();
    fn test_field_vOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vOffset) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(vOffset)
            )
        );
    }
    test_field_vOffset();
    fn test_field_uScale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).uScale) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(uScale)
            )
        );
    }
    test_field_uScale();
    fn test_field_vScale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vScale) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(vScale)
            )
        );
    }
    test_field_vScale();
    fn test_field_gridDivs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gridDivs) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(gridDivs)
            )
        );
    }
    test_field_gridDivs();
    fn test_field_gridWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gridWidth) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(gridWidth)
            )
        );
    }
    test_field_gridWidth();
    fn test_field_gridScale() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gridScale) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(gridScale)
            )
        );
    }
    test_field_gridScale();
    fn test_field_transform() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_OverlaySettings>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).transform) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_OverlaySettings),
                "::",
                stringify!(transform)
            )
        );
    }
    test_field_transform();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRBoneTransform_t {
    pub position: HmdVector4_t,
    pub orientation: HmdQuaternionf_t,
}
#[test]
fn bindgen_test_layout_VRBoneTransform_t() {
    assert_eq!(
        ::std::mem::size_of::<VRBoneTransform_t>(),
        32usize,
        concat!("Size of: ", stringify!(VRBoneTransform_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRBoneTransform_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VRBoneTransform_t))
    );
    fn test_field_position() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRBoneTransform_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRBoneTransform_t),
                "::",
                stringify!(position)
            )
        );
    }
    test_field_position();
    fn test_field_orientation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRBoneTransform_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).orientation) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VRBoneTransform_t),
                "::",
                stringify!(orientation)
            )
        );
    }
    test_field_orientation();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CameraVideoStreamFrameHeader_t {
    pub eFrameType: EVRTrackedCameraFrameType,
    pub nWidth: u32,
    pub nHeight: u32,
    pub nBytesPerPixel: u32,
    pub nFrameSequence: u32,
    pub standingTrackedDevicePose: TrackedDevicePose_t,
    pub ulFrameExposureTime: u64,
}
#[test]
fn bindgen_test_layout_CameraVideoStreamFrameHeader_t() {
    assert_eq!(
        ::std::mem::size_of::<CameraVideoStreamFrameHeader_t>(),
        112usize,
        concat!("Size of: ", stringify!(CameraVideoStreamFrameHeader_t))
    );
    assert_eq!(
        ::std::mem::align_of::<CameraVideoStreamFrameHeader_t>(),
        8usize,
        concat!("Alignment of ", stringify!(CameraVideoStreamFrameHeader_t))
    );
    fn test_field_eFrameType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CameraVideoStreamFrameHeader_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eFrameType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(CameraVideoStreamFrameHeader_t),
                "::",
                stringify!(eFrameType)
            )
        );
    }
    test_field_eFrameType();
    fn test_field_nWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CameraVideoStreamFrameHeader_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nWidth) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(CameraVideoStreamFrameHeader_t),
                "::",
                stringify!(nWidth)
            )
        );
    }
    test_field_nWidth();
    fn test_field_nHeight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CameraVideoStreamFrameHeader_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nHeight) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(CameraVideoStreamFrameHeader_t),
                "::",
                stringify!(nHeight)
            )
        );
    }
    test_field_nHeight();
    fn test_field_nBytesPerPixel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CameraVideoStreamFrameHeader_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nBytesPerPixel) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(CameraVideoStreamFrameHeader_t),
                "::",
                stringify!(nBytesPerPixel)
            )
        );
    }
    test_field_nBytesPerPixel();
    fn test_field_nFrameSequence() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CameraVideoStreamFrameHeader_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nFrameSequence) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(CameraVideoStreamFrameHeader_t),
                "::",
                stringify!(nFrameSequence)
            )
        );
    }
    test_field_nFrameSequence();
    fn test_field_standingTrackedDevicePose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CameraVideoStreamFrameHeader_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).standingTrackedDevicePose) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(CameraVideoStreamFrameHeader_t),
                "::",
                stringify!(standingTrackedDevicePose)
            )
        );
    }
    test_field_standingTrackedDevicePose();
    fn test_field_ulFrameExposureTime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CameraVideoStreamFrameHeader_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ulFrameExposureTime) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(CameraVideoStreamFrameHeader_t),
                "::",
                stringify!(ulFrameExposureTime)
            )
        );
    }
    test_field_ulFrameExposureTime();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DriverDirectMode_FrameTiming {
    pub m_nSize: u32,
    pub m_nNumFramePresents: u32,
    pub m_nNumMisPresented: u32,
    pub m_nNumDroppedFrames: u32,
    pub m_nReprojectionFlags: u32,
}
#[test]
fn bindgen_test_layout_DriverDirectMode_FrameTiming() {
    assert_eq!(
        ::std::mem::size_of::<DriverDirectMode_FrameTiming>(),
        20usize,
        concat!("Size of: ", stringify!(DriverDirectMode_FrameTiming))
    );
    assert_eq!(
        ::std::mem::align_of::<DriverDirectMode_FrameTiming>(),
        4usize,
        concat!("Alignment of ", stringify!(DriverDirectMode_FrameTiming))
    );
    fn test_field_m_nSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DriverDirectMode_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nSize) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(DriverDirectMode_FrameTiming),
                "::",
                stringify!(m_nSize)
            )
        );
    }
    test_field_m_nSize();
    fn test_field_m_nNumFramePresents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DriverDirectMode_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumFramePresents) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(DriverDirectMode_FrameTiming),
                "::",
                stringify!(m_nNumFramePresents)
            )
        );
    }
    test_field_m_nNumFramePresents();
    fn test_field_m_nNumMisPresented() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DriverDirectMode_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumMisPresented) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(DriverDirectMode_FrameTiming),
                "::",
                stringify!(m_nNumMisPresented)
            )
        );
    }
    test_field_m_nNumMisPresented();
    fn test_field_m_nNumDroppedFrames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DriverDirectMode_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumDroppedFrames) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(DriverDirectMode_FrameTiming),
                "::",
                stringify!(m_nNumDroppedFrames)
            )
        );
    }
    test_field_m_nNumDroppedFrames();
    fn test_field_m_nReprojectionFlags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DriverDirectMode_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nReprojectionFlags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(DriverDirectMode_FrameTiming),
                "::",
                stringify!(m_nReprojectionFlags)
            )
        );
    }
    test_field_m_nReprojectionFlags();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImuSample_t {
    pub fSampleTime: f64,
    pub vAccel: HmdVector3d_t,
    pub vGyro: HmdVector3d_t,
    pub unOffScaleFlags: u32,
}
#[test]
fn bindgen_test_layout_ImuSample_t() {
    assert_eq!(
        ::std::mem::size_of::<ImuSample_t>(),
        64usize,
        concat!("Size of: ", stringify!(ImuSample_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ImuSample_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ImuSample_t))
    );
    fn test_field_fSampleTime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImuSample_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fSampleTime) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ImuSample_t),
                "::",
                stringify!(fSampleTime)
            )
        );
    }
    test_field_fSampleTime();
    fn test_field_vAccel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImuSample_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vAccel) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ImuSample_t),
                "::",
                stringify!(vAccel)
            )
        );
    }
    test_field_vAccel();
    fn test_field_vGyro() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImuSample_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vGyro) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(ImuSample_t),
                "::",
                stringify!(vGyro)
            )
        );
    }
    test_field_vGyro();
    fn test_field_unOffScaleFlags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ImuSample_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unOffScaleFlags) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(ImuSample_t),
                "::",
                stringify!(unOffScaleFlags)
            )
        );
    }
    test_field_unOffScaleFlags();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AppOverrideKeys_t {
    pub pchKey: *mut ::std::os::raw::c_char,
    pub pchValue: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_AppOverrideKeys_t() {
    assert_eq!(
        ::std::mem::size_of::<AppOverrideKeys_t>(),
        16usize,
        concat!("Size of: ", stringify!(AppOverrideKeys_t))
    );
    assert_eq!(
        ::std::mem::align_of::<AppOverrideKeys_t>(),
        8usize,
        concat!("Alignment of ", stringify!(AppOverrideKeys_t))
    );
    fn test_field_pchKey() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<AppOverrideKeys_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pchKey) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(AppOverrideKeys_t),
                "::",
                stringify!(pchKey)
            )
        );
    }
    test_field_pchKey();
    fn test_field_pchValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<AppOverrideKeys_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pchValue) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(AppOverrideKeys_t),
                "::",
                stringify!(pchValue)
            )
        );
    }
    test_field_pchValue();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Compositor_FrameTiming {
    pub m_nSize: u32,
    pub m_nFrameIndex: u32,
    pub m_nNumFramePresents: u32,
    pub m_nNumMisPresented: u32,
    pub m_nNumDroppedFrames: u32,
    pub m_nReprojectionFlags: u32,
    pub m_flSystemTimeInSeconds: f64,
    pub m_flPreSubmitGpuMs: f32,
    pub m_flPostSubmitGpuMs: f32,
    pub m_flTotalRenderGpuMs: f32,
    pub m_flCompositorRenderGpuMs: f32,
    pub m_flCompositorRenderCpuMs: f32,
    pub m_flCompositorIdleCpuMs: f32,
    pub m_flClientFrameIntervalMs: f32,
    pub m_flPresentCallCpuMs: f32,
    pub m_flWaitForPresentCpuMs: f32,
    pub m_flSubmitFrameMs: f32,
    pub m_flWaitGetPosesCalledMs: f32,
    pub m_flNewPosesReadyMs: f32,
    pub m_flNewFrameReadyMs: f32,
    pub m_flCompositorUpdateStartMs: f32,
    pub m_flCompositorUpdateEndMs: f32,
    pub m_flCompositorRenderStartMs: f32,
    pub m_HmdPose: TrackedDevicePose_t,
    pub m_nNumVSyncsReadyForUse: u32,
    pub m_nNumVSyncsToFirstView: u32,
}
#[test]
fn bindgen_test_layout_Compositor_FrameTiming() {
    assert_eq!(
        ::std::mem::size_of::<Compositor_FrameTiming>(),
        184usize,
        concat!("Size of: ", stringify!(Compositor_FrameTiming))
    );
    assert_eq!(
        ::std::mem::align_of::<Compositor_FrameTiming>(),
        8usize,
        concat!("Alignment of ", stringify!(Compositor_FrameTiming))
    );
    fn test_field_m_nSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nSize) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_nSize)
            )
        );
    }
    test_field_m_nSize();
    fn test_field_m_nFrameIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nFrameIndex) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_nFrameIndex)
            )
        );
    }
    test_field_m_nFrameIndex();
    fn test_field_m_nNumFramePresents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumFramePresents) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_nNumFramePresents)
            )
        );
    }
    test_field_m_nNumFramePresents();
    fn test_field_m_nNumMisPresented() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumMisPresented) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_nNumMisPresented)
            )
        );
    }
    test_field_m_nNumMisPresented();
    fn test_field_m_nNumDroppedFrames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumDroppedFrames) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_nNumDroppedFrames)
            )
        );
    }
    test_field_m_nNumDroppedFrames();
    fn test_field_m_nReprojectionFlags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nReprojectionFlags) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_nReprojectionFlags)
            )
        );
    }
    test_field_m_nReprojectionFlags();
    fn test_field_m_flSystemTimeInSeconds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flSystemTimeInSeconds) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flSystemTimeInSeconds)
            )
        );
    }
    test_field_m_flSystemTimeInSeconds();
    fn test_field_m_flPreSubmitGpuMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flPreSubmitGpuMs) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flPreSubmitGpuMs)
            )
        );
    }
    test_field_m_flPreSubmitGpuMs();
    fn test_field_m_flPostSubmitGpuMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flPostSubmitGpuMs) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flPostSubmitGpuMs)
            )
        );
    }
    test_field_m_flPostSubmitGpuMs();
    fn test_field_m_flTotalRenderGpuMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flTotalRenderGpuMs) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flTotalRenderGpuMs)
            )
        );
    }
    test_field_m_flTotalRenderGpuMs();
    fn test_field_m_flCompositorRenderGpuMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flCompositorRenderGpuMs) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flCompositorRenderGpuMs)
            )
        );
    }
    test_field_m_flCompositorRenderGpuMs();
    fn test_field_m_flCompositorRenderCpuMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flCompositorRenderCpuMs) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flCompositorRenderCpuMs)
            )
        );
    }
    test_field_m_flCompositorRenderCpuMs();
    fn test_field_m_flCompositorIdleCpuMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flCompositorIdleCpuMs) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flCompositorIdleCpuMs)
            )
        );
    }
    test_field_m_flCompositorIdleCpuMs();
    fn test_field_m_flClientFrameIntervalMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flClientFrameIntervalMs) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flClientFrameIntervalMs)
            )
        );
    }
    test_field_m_flClientFrameIntervalMs();
    fn test_field_m_flPresentCallCpuMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flPresentCallCpuMs) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flPresentCallCpuMs)
            )
        );
    }
    test_field_m_flPresentCallCpuMs();
    fn test_field_m_flWaitForPresentCpuMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flWaitForPresentCpuMs) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flWaitForPresentCpuMs)
            )
        );
    }
    test_field_m_flWaitForPresentCpuMs();
    fn test_field_m_flSubmitFrameMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flSubmitFrameMs) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flSubmitFrameMs)
            )
        );
    }
    test_field_m_flSubmitFrameMs();
    fn test_field_m_flWaitGetPosesCalledMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flWaitGetPosesCalledMs) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flWaitGetPosesCalledMs)
            )
        );
    }
    test_field_m_flWaitGetPosesCalledMs();
    fn test_field_m_flNewPosesReadyMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flNewPosesReadyMs) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flNewPosesReadyMs)
            )
        );
    }
    test_field_m_flNewPosesReadyMs();
    fn test_field_m_flNewFrameReadyMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flNewFrameReadyMs) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flNewFrameReadyMs)
            )
        );
    }
    test_field_m_flNewFrameReadyMs();
    fn test_field_m_flCompositorUpdateStartMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flCompositorUpdateStartMs) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flCompositorUpdateStartMs)
            )
        );
    }
    test_field_m_flCompositorUpdateStartMs();
    fn test_field_m_flCompositorUpdateEndMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flCompositorUpdateEndMs) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flCompositorUpdateEndMs)
            )
        );
    }
    test_field_m_flCompositorUpdateEndMs();
    fn test_field_m_flCompositorRenderStartMs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flCompositorRenderStartMs) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_flCompositorRenderStartMs)
            )
        );
    }
    test_field_m_flCompositorRenderStartMs();
    fn test_field_m_HmdPose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_HmdPose) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_HmdPose)
            )
        );
    }
    test_field_m_HmdPose();
    fn test_field_m_nNumVSyncsReadyForUse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumVSyncsReadyForUse) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_nNumVSyncsReadyForUse)
            )
        );
    }
    test_field_m_nNumVSyncsReadyForUse();
    fn test_field_m_nNumVSyncsToFirstView() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_FrameTiming>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumVSyncsToFirstView) as usize - ptr as usize
            },
            180usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_FrameTiming),
                "::",
                stringify!(m_nNumVSyncsToFirstView)
            )
        );
    }
    test_field_m_nNumVSyncsToFirstView();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Compositor_CumulativeStats {
    pub m_nPid: u32,
    pub m_nNumFramePresents: u32,
    pub m_nNumDroppedFrames: u32,
    pub m_nNumReprojectedFrames: u32,
    pub m_nNumFramePresentsOnStartup: u32,
    pub m_nNumDroppedFramesOnStartup: u32,
    pub m_nNumReprojectedFramesOnStartup: u32,
    pub m_nNumLoading: u32,
    pub m_nNumFramePresentsLoading: u32,
    pub m_nNumDroppedFramesLoading: u32,
    pub m_nNumReprojectedFramesLoading: u32,
    pub m_nNumTimedOut: u32,
    pub m_nNumFramePresentsTimedOut: u32,
    pub m_nNumDroppedFramesTimedOut: u32,
    pub m_nNumReprojectedFramesTimedOut: u32,
}
#[test]
fn bindgen_test_layout_Compositor_CumulativeStats() {
    assert_eq!(
        ::std::mem::size_of::<Compositor_CumulativeStats>(),
        60usize,
        concat!("Size of: ", stringify!(Compositor_CumulativeStats))
    );
    assert_eq!(
        ::std::mem::align_of::<Compositor_CumulativeStats>(),
        4usize,
        concat!("Alignment of ", stringify!(Compositor_CumulativeStats))
    );
    fn test_field_m_nPid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nPid) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nPid)
            )
        );
    }
    test_field_m_nPid();
    fn test_field_m_nNumFramePresents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumFramePresents) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumFramePresents)
            )
        );
    }
    test_field_m_nNumFramePresents();
    fn test_field_m_nNumDroppedFrames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumDroppedFrames) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumDroppedFrames)
            )
        );
    }
    test_field_m_nNumDroppedFrames();
    fn test_field_m_nNumReprojectedFrames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumReprojectedFrames) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumReprojectedFrames)
            )
        );
    }
    test_field_m_nNumReprojectedFrames();
    fn test_field_m_nNumFramePresentsOnStartup() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumFramePresentsOnStartup) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumFramePresentsOnStartup)
            )
        );
    }
    test_field_m_nNumFramePresentsOnStartup();
    fn test_field_m_nNumDroppedFramesOnStartup() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumDroppedFramesOnStartup) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumDroppedFramesOnStartup)
            )
        );
    }
    test_field_m_nNumDroppedFramesOnStartup();
    fn test_field_m_nNumReprojectedFramesOnStartup() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumReprojectedFramesOnStartup) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumReprojectedFramesOnStartup)
            )
        );
    }
    test_field_m_nNumReprojectedFramesOnStartup();
    fn test_field_m_nNumLoading() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumLoading) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumLoading)
            )
        );
    }
    test_field_m_nNumLoading();
    fn test_field_m_nNumFramePresentsLoading() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumFramePresentsLoading) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumFramePresentsLoading)
            )
        );
    }
    test_field_m_nNumFramePresentsLoading();
    fn test_field_m_nNumDroppedFramesLoading() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumDroppedFramesLoading) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumDroppedFramesLoading)
            )
        );
    }
    test_field_m_nNumDroppedFramesLoading();
    fn test_field_m_nNumReprojectedFramesLoading() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumReprojectedFramesLoading) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumReprojectedFramesLoading)
            )
        );
    }
    test_field_m_nNumReprojectedFramesLoading();
    fn test_field_m_nNumTimedOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumTimedOut) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumTimedOut)
            )
        );
    }
    test_field_m_nNumTimedOut();
    fn test_field_m_nNumFramePresentsTimedOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumFramePresentsTimedOut) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumFramePresentsTimedOut)
            )
        );
    }
    test_field_m_nNumFramePresentsTimedOut();
    fn test_field_m_nNumDroppedFramesTimedOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumDroppedFramesTimedOut) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumDroppedFramesTimedOut)
            )
        );
    }
    test_field_m_nNumDroppedFramesTimedOut();
    fn test_field_m_nNumReprojectedFramesTimedOut() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Compositor_CumulativeStats>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nNumReprojectedFramesTimedOut) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(Compositor_CumulativeStats),
                "::",
                stringify!(m_nNumReprojectedFramesTimedOut)
            )
        );
    }
    test_field_m_nNumReprojectedFramesTimedOut();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VROverlayIntersectionParams_t {
    pub vSource: HmdVector3_t,
    pub vDirection: HmdVector3_t,
    pub eOrigin: ETrackingUniverseOrigin,
}
#[test]
fn bindgen_test_layout_VROverlayIntersectionParams_t() {
    assert_eq!(
        ::std::mem::size_of::<VROverlayIntersectionParams_t>(),
        28usize,
        concat!("Size of: ", stringify!(VROverlayIntersectionParams_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VROverlayIntersectionParams_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VROverlayIntersectionParams_t))
    );
    fn test_field_vSource() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VROverlayIntersectionParams_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vSource) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionParams_t),
                "::",
                stringify!(vSource)
            )
        );
    }
    test_field_vSource();
    fn test_field_vDirection() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VROverlayIntersectionParams_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vDirection) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionParams_t),
                "::",
                stringify!(vDirection)
            )
        );
    }
    test_field_vDirection();
    fn test_field_eOrigin() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VROverlayIntersectionParams_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eOrigin) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionParams_t),
                "::",
                stringify!(eOrigin)
            )
        );
    }
    test_field_eOrigin();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VROverlayIntersectionResults_t {
    pub vPoint: HmdVector3_t,
    pub vNormal: HmdVector3_t,
    pub vUVs: HmdVector2_t,
    pub fDistance: f32,
}
#[test]
fn bindgen_test_layout_VROverlayIntersectionResults_t() {
    assert_eq!(
        ::std::mem::size_of::<VROverlayIntersectionResults_t>(),
        36usize,
        concat!("Size of: ", stringify!(VROverlayIntersectionResults_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VROverlayIntersectionResults_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VROverlayIntersectionResults_t))
    );
    fn test_field_vPoint() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VROverlayIntersectionResults_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vPoint) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionResults_t),
                "::",
                stringify!(vPoint)
            )
        );
    }
    test_field_vPoint();
    fn test_field_vNormal() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VROverlayIntersectionResults_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vNormal) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionResults_t),
                "::",
                stringify!(vNormal)
            )
        );
    }
    test_field_vNormal();
    fn test_field_vUVs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VROverlayIntersectionResults_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vUVs) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionResults_t),
                "::",
                stringify!(vUVs)
            )
        );
    }
    test_field_vUVs();
    fn test_field_fDistance() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VROverlayIntersectionResults_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fDistance) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionResults_t),
                "::",
                stringify!(fDistance)
            )
        );
    }
    test_field_fDistance();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IntersectionMaskRectangle_t {
    pub m_flTopLeftX: f32,
    pub m_flTopLeftY: f32,
    pub m_flWidth: f32,
    pub m_flHeight: f32,
}
#[test]
fn bindgen_test_layout_IntersectionMaskRectangle_t() {
    assert_eq!(
        ::std::mem::size_of::<IntersectionMaskRectangle_t>(),
        16usize,
        concat!("Size of: ", stringify!(IntersectionMaskRectangle_t))
    );
    assert_eq!(
        ::std::mem::align_of::<IntersectionMaskRectangle_t>(),
        4usize,
        concat!("Alignment of ", stringify!(IntersectionMaskRectangle_t))
    );
    fn test_field_m_flTopLeftX() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<IntersectionMaskRectangle_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flTopLeftX) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(IntersectionMaskRectangle_t),
                "::",
                stringify!(m_flTopLeftX)
            )
        );
    }
    test_field_m_flTopLeftX();
    fn test_field_m_flTopLeftY() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<IntersectionMaskRectangle_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flTopLeftY) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(IntersectionMaskRectangle_t),
                "::",
                stringify!(m_flTopLeftY)
            )
        );
    }
    test_field_m_flTopLeftY();
    fn test_field_m_flWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<IntersectionMaskRectangle_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flWidth) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(IntersectionMaskRectangle_t),
                "::",
                stringify!(m_flWidth)
            )
        );
    }
    test_field_m_flWidth();
    fn test_field_m_flHeight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<IntersectionMaskRectangle_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flHeight) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(IntersectionMaskRectangle_t),
                "::",
                stringify!(m_flHeight)
            )
        );
    }
    test_field_m_flHeight();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IntersectionMaskCircle_t {
    pub m_flCenterX: f32,
    pub m_flCenterY: f32,
    pub m_flRadius: f32,
}
#[test]
fn bindgen_test_layout_IntersectionMaskCircle_t() {
    assert_eq!(
        ::std::mem::size_of::<IntersectionMaskCircle_t>(),
        12usize,
        concat!("Size of: ", stringify!(IntersectionMaskCircle_t))
    );
    assert_eq!(
        ::std::mem::align_of::<IntersectionMaskCircle_t>(),
        4usize,
        concat!("Alignment of ", stringify!(IntersectionMaskCircle_t))
    );
    fn test_field_m_flCenterX() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<IntersectionMaskCircle_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flCenterX) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(IntersectionMaskCircle_t),
                "::",
                stringify!(m_flCenterX)
            )
        );
    }
    test_field_m_flCenterX();
    fn test_field_m_flCenterY() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<IntersectionMaskCircle_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flCenterY) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(IntersectionMaskCircle_t),
                "::",
                stringify!(m_flCenterY)
            )
        );
    }
    test_field_m_flCenterY();
    fn test_field_m_flRadius() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<IntersectionMaskCircle_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_flRadius) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(IntersectionMaskCircle_t),
                "::",
                stringify!(m_flRadius)
            )
        );
    }
    test_field_m_flRadius();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RenderModel_ComponentState_t {
    pub mTrackingToComponentRenderModel: HmdMatrix34_t,
    pub mTrackingToComponentLocal: HmdMatrix34_t,
    pub uProperties: VRComponentProperties,
}
#[test]
fn bindgen_test_layout_RenderModel_ComponentState_t() {
    assert_eq!(
        ::std::mem::size_of::<RenderModel_ComponentState_t>(),
        100usize,
        concat!("Size of: ", stringify!(RenderModel_ComponentState_t))
    );
    assert_eq!(
        ::std::mem::align_of::<RenderModel_ComponentState_t>(),
        4usize,
        concat!("Alignment of ", stringify!(RenderModel_ComponentState_t))
    );
    fn test_field_mTrackingToComponentRenderModel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_ComponentState_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mTrackingToComponentRenderModel) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_ComponentState_t),
                "::",
                stringify!(mTrackingToComponentRenderModel)
            )
        );
    }
    test_field_mTrackingToComponentRenderModel();
    fn test_field_mTrackingToComponentLocal() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_ComponentState_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mTrackingToComponentLocal) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_ComponentState_t),
                "::",
                stringify!(mTrackingToComponentLocal)
            )
        );
    }
    test_field_mTrackingToComponentLocal();
    fn test_field_uProperties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_ComponentState_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).uProperties) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_ComponentState_t),
                "::",
                stringify!(uProperties)
            )
        );
    }
    test_field_uProperties();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RenderModel_Vertex_t {
    pub vPosition: HmdVector3_t,
    pub vNormal: HmdVector3_t,
    pub rfTextureCoord: [f32; 2usize],
}
#[test]
fn bindgen_test_layout_RenderModel_Vertex_t() {
    assert_eq!(
        ::std::mem::size_of::<RenderModel_Vertex_t>(),
        32usize,
        concat!("Size of: ", stringify!(RenderModel_Vertex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<RenderModel_Vertex_t>(),
        4usize,
        concat!("Alignment of ", stringify!(RenderModel_Vertex_t))
    );
    fn test_field_vPosition() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_Vertex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vPosition) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_Vertex_t),
                "::",
                stringify!(vPosition)
            )
        );
    }
    test_field_vPosition();
    fn test_field_vNormal() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_Vertex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vNormal) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_Vertex_t),
                "::",
                stringify!(vNormal)
            )
        );
    }
    test_field_vNormal();
    fn test_field_rfTextureCoord() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_Vertex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rfTextureCoord) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_Vertex_t),
                "::",
                stringify!(rfTextureCoord)
            )
        );
    }
    test_field_rfTextureCoord();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RenderModel_TextureMap_t {
    pub unWidth: u16,
    pub unHeight: u16,
    pub rubTextureMapData: *mut u8,
}
#[test]
fn bindgen_test_layout_RenderModel_TextureMap_t() {
    assert_eq!(
        ::std::mem::size_of::<RenderModel_TextureMap_t>(),
        16usize,
        concat!("Size of: ", stringify!(RenderModel_TextureMap_t))
    );
    assert_eq!(
        ::std::mem::align_of::<RenderModel_TextureMap_t>(),
        8usize,
        concat!("Alignment of ", stringify!(RenderModel_TextureMap_t))
    );
    fn test_field_unWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_TextureMap_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unWidth) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_TextureMap_t),
                "::",
                stringify!(unWidth)
            )
        );
    }
    test_field_unWidth();
    fn test_field_unHeight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_TextureMap_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unHeight) as usize - ptr as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_TextureMap_t),
                "::",
                stringify!(unHeight)
            )
        );
    }
    test_field_unHeight();
    fn test_field_rubTextureMapData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_TextureMap_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rubTextureMapData) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_TextureMap_t),
                "::",
                stringify!(rubTextureMapData)
            )
        );
    }
    test_field_rubTextureMapData();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RenderModel_t {
    pub rVertexData: *mut RenderModel_Vertex_t,
    pub unVertexCount: u32,
    pub rIndexData: *mut u16,
    pub unTriangleCount: u32,
    pub diffuseTextureId: TextureID_t,
}
#[test]
fn bindgen_test_layout_RenderModel_t() {
    assert_eq!(
        ::std::mem::size_of::<RenderModel_t>(),
        32usize,
        concat!("Size of: ", stringify!(RenderModel_t))
    );
    assert_eq!(
        ::std::mem::align_of::<RenderModel_t>(),
        8usize,
        concat!("Alignment of ", stringify!(RenderModel_t))
    );
    fn test_field_rVertexData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rVertexData) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_t),
                "::",
                stringify!(rVertexData)
            )
        );
    }
    test_field_rVertexData();
    fn test_field_unVertexCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unVertexCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_t),
                "::",
                stringify!(unVertexCount)
            )
        );
    }
    test_field_unVertexCount();
    fn test_field_rIndexData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rIndexData) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_t),
                "::",
                stringify!(rIndexData)
            )
        );
    }
    test_field_rIndexData();
    fn test_field_unTriangleCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unTriangleCount) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_t),
                "::",
                stringify!(unTriangleCount)
            )
        );
    }
    test_field_unTriangleCount();
    fn test_field_diffuseTextureId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RenderModel_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).diffuseTextureId) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_t),
                "::",
                stringify!(diffuseTextureId)
            )
        );
    }
    test_field_diffuseTextureId();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RenderModel_ControllerMode_State_t {
    pub bScrollWheelVisible: bool,
}
#[test]
fn bindgen_test_layout_RenderModel_ControllerMode_State_t() {
    assert_eq!(
        ::std::mem::size_of::<RenderModel_ControllerMode_State_t>(),
        1usize,
        concat!("Size of: ", stringify!(RenderModel_ControllerMode_State_t))
    );
    assert_eq!(
        ::std::mem::align_of::<RenderModel_ControllerMode_State_t>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(RenderModel_ControllerMode_State_t)
        )
    );
    fn test_field_bScrollWheelVisible() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<RenderModel_ControllerMode_State_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bScrollWheelVisible) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(RenderModel_ControllerMode_State_t),
                "::",
                stringify!(bScrollWheelVisible)
            )
        );
    }
    test_field_bScrollWheelVisible();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NotificationBitmap_t {
    pub m_pImageData: *mut ::std::os::raw::c_void,
    pub m_nWidth: i32,
    pub m_nHeight: i32,
    pub m_nBytesPerPixel: i32,
}
#[test]
fn bindgen_test_layout_NotificationBitmap_t() {
    assert_eq!(
        ::std::mem::size_of::<NotificationBitmap_t>(),
        24usize,
        concat!("Size of: ", stringify!(NotificationBitmap_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NotificationBitmap_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NotificationBitmap_t))
    );
    fn test_field_m_pImageData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NotificationBitmap_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pImageData) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NotificationBitmap_t),
                "::",
                stringify!(m_pImageData)
            )
        );
    }
    test_field_m_pImageData();
    fn test_field_m_nWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NotificationBitmap_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nWidth) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NotificationBitmap_t),
                "::",
                stringify!(m_nWidth)
            )
        );
    }
    test_field_m_nWidth();
    fn test_field_m_nHeight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NotificationBitmap_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nHeight) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(NotificationBitmap_t),
                "::",
                stringify!(m_nHeight)
            )
        );
    }
    test_field_m_nHeight();
    fn test_field_m_nBytesPerPixel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NotificationBitmap_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nBytesPerPixel) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NotificationBitmap_t),
                "::",
                stringify!(m_nBytesPerPixel)
            )
        );
    }
    test_field_m_nBytesPerPixel();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CVRSettingHelper {
    pub m_pSettings: isize,
}
#[test]
fn bindgen_test_layout_CVRSettingHelper() {
    assert_eq!(
        ::std::mem::size_of::<CVRSettingHelper>(),
        8usize,
        concat!("Size of: ", stringify!(CVRSettingHelper))
    );
    assert_eq!(
        ::std::mem::align_of::<CVRSettingHelper>(),
        8usize,
        concat!("Alignment of ", stringify!(CVRSettingHelper))
    );
    fn test_field_m_pSettings() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<CVRSettingHelper>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pSettings) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(CVRSettingHelper),
                "::",
                stringify!(m_pSettings)
            )
        );
    }
    test_field_m_pSettings();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InputAnalogActionData_t {
    pub bActive: bool,
    pub activeOrigin: VRInputValueHandle_t,
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub deltaX: f32,
    pub deltaY: f32,
    pub deltaZ: f32,
    pub fUpdateTime: f32,
}
#[test]
fn bindgen_test_layout_InputAnalogActionData_t() {
    assert_eq!(
        ::std::mem::size_of::<InputAnalogActionData_t>(),
        48usize,
        concat!("Size of: ", stringify!(InputAnalogActionData_t))
    );
    assert_eq!(
        ::std::mem::align_of::<InputAnalogActionData_t>(),
        8usize,
        concat!("Alignment of ", stringify!(InputAnalogActionData_t))
    );
    fn test_field_bActive() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputAnalogActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bActive) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(InputAnalogActionData_t),
                "::",
                stringify!(bActive)
            )
        );
    }
    test_field_bActive();
    fn test_field_activeOrigin() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputAnalogActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).activeOrigin) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(InputAnalogActionData_t),
                "::",
                stringify!(activeOrigin)
            )
        );
    }
    test_field_activeOrigin();
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputAnalogActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(InputAnalogActionData_t),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputAnalogActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(InputAnalogActionData_t),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
    fn test_field_z() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputAnalogActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(InputAnalogActionData_t),
                "::",
                stringify!(z)
            )
        );
    }
    test_field_z();
    fn test_field_deltaX() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputAnalogActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deltaX) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(InputAnalogActionData_t),
                "::",
                stringify!(deltaX)
            )
        );
    }
    test_field_deltaX();
    fn test_field_deltaY() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputAnalogActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deltaY) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(InputAnalogActionData_t),
                "::",
                stringify!(deltaY)
            )
        );
    }
    test_field_deltaY();
    fn test_field_deltaZ() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputAnalogActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deltaZ) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(InputAnalogActionData_t),
                "::",
                stringify!(deltaZ)
            )
        );
    }
    test_field_deltaZ();
    fn test_field_fUpdateTime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputAnalogActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fUpdateTime) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(InputAnalogActionData_t),
                "::",
                stringify!(fUpdateTime)
            )
        );
    }
    test_field_fUpdateTime();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InputDigitalActionData_t {
    pub bActive: bool,
    pub activeOrigin: VRInputValueHandle_t,
    pub bState: bool,
    pub bChanged: bool,
    pub fUpdateTime: f32,
}
#[test]
fn bindgen_test_layout_InputDigitalActionData_t() {
    assert_eq!(
        ::std::mem::size_of::<InputDigitalActionData_t>(),
        24usize,
        concat!("Size of: ", stringify!(InputDigitalActionData_t))
    );
    assert_eq!(
        ::std::mem::align_of::<InputDigitalActionData_t>(),
        8usize,
        concat!("Alignment of ", stringify!(InputDigitalActionData_t))
    );
    fn test_field_bActive() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputDigitalActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bActive) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(InputDigitalActionData_t),
                "::",
                stringify!(bActive)
            )
        );
    }
    test_field_bActive();
    fn test_field_activeOrigin() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputDigitalActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).activeOrigin) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(InputDigitalActionData_t),
                "::",
                stringify!(activeOrigin)
            )
        );
    }
    test_field_activeOrigin();
    fn test_field_bState() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputDigitalActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bState) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(InputDigitalActionData_t),
                "::",
                stringify!(bState)
            )
        );
    }
    test_field_bState();
    fn test_field_bChanged() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputDigitalActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bChanged) as usize - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(InputDigitalActionData_t),
                "::",
                stringify!(bChanged)
            )
        );
    }
    test_field_bChanged();
    fn test_field_fUpdateTime() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputDigitalActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fUpdateTime) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(InputDigitalActionData_t),
                "::",
                stringify!(fUpdateTime)
            )
        );
    }
    test_field_fUpdateTime();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InputPoseActionData_t {
    pub bActive: bool,
    pub activeOrigin: VRInputValueHandle_t,
    pub pose: TrackedDevicePose_t,
}
#[test]
fn bindgen_test_layout_InputPoseActionData_t() {
    assert_eq!(
        ::std::mem::size_of::<InputPoseActionData_t>(),
        96usize,
        concat!("Size of: ", stringify!(InputPoseActionData_t))
    );
    assert_eq!(
        ::std::mem::align_of::<InputPoseActionData_t>(),
        8usize,
        concat!("Alignment of ", stringify!(InputPoseActionData_t))
    );
    fn test_field_bActive() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputPoseActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bActive) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(InputPoseActionData_t),
                "::",
                stringify!(bActive)
            )
        );
    }
    test_field_bActive();
    fn test_field_activeOrigin() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputPoseActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).activeOrigin) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(InputPoseActionData_t),
                "::",
                stringify!(activeOrigin)
            )
        );
    }
    test_field_activeOrigin();
    fn test_field_pose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputPoseActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(InputPoseActionData_t),
                "::",
                stringify!(pose)
            )
        );
    }
    test_field_pose();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InputSkeletalActionData_t {
    pub bActive: bool,
    pub activeOrigin: VRInputValueHandle_t,
}
#[test]
fn bindgen_test_layout_InputSkeletalActionData_t() {
    assert_eq!(
        ::std::mem::size_of::<InputSkeletalActionData_t>(),
        16usize,
        concat!("Size of: ", stringify!(InputSkeletalActionData_t))
    );
    assert_eq!(
        ::std::mem::align_of::<InputSkeletalActionData_t>(),
        8usize,
        concat!("Alignment of ", stringify!(InputSkeletalActionData_t))
    );
    fn test_field_bActive() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputSkeletalActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bActive) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(InputSkeletalActionData_t),
                "::",
                stringify!(bActive)
            )
        );
    }
    test_field_bActive();
    fn test_field_activeOrigin() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputSkeletalActionData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).activeOrigin) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(InputSkeletalActionData_t),
                "::",
                stringify!(activeOrigin)
            )
        );
    }
    test_field_activeOrigin();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InputOriginInfo_t {
    pub devicePath: VRInputValueHandle_t,
    pub trackedDeviceIndex: TrackedDeviceIndex_t,
    pub rchRenderModelComponentName: [::std::os::raw::c_char; 128usize],
}
#[test]
fn bindgen_test_layout_InputOriginInfo_t() {
    assert_eq!(
        ::std::mem::size_of::<InputOriginInfo_t>(),
        144usize,
        concat!("Size of: ", stringify!(InputOriginInfo_t))
    );
    assert_eq!(
        ::std::mem::align_of::<InputOriginInfo_t>(),
        8usize,
        concat!("Alignment of ", stringify!(InputOriginInfo_t))
    );
    fn test_field_devicePath() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputOriginInfo_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).devicePath) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(InputOriginInfo_t),
                "::",
                stringify!(devicePath)
            )
        );
    }
    test_field_devicePath();
    fn test_field_trackedDeviceIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputOriginInfo_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trackedDeviceIndex) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(InputOriginInfo_t),
                "::",
                stringify!(trackedDeviceIndex)
            )
        );
    }
    test_field_trackedDeviceIndex();
    fn test_field_rchRenderModelComponentName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<InputOriginInfo_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rchRenderModelComponentName) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(InputOriginInfo_t),
                "::",
                stringify!(rchRenderModelComponentName)
            )
        );
    }
    test_field_rchRenderModelComponentName();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRActiveActionSet_t {
    pub ulActionSet: VRActionSetHandle_t,
    pub ulRestrictedToDevice: VRInputValueHandle_t,
    pub ulSecondaryActionSet: VRActionSetHandle_t,
    pub unPadding: u32,
    pub nPriority: i32,
}
#[test]
fn bindgen_test_layout_VRActiveActionSet_t() {
    assert_eq!(
        ::std::mem::size_of::<VRActiveActionSet_t>(),
        32usize,
        concat!("Size of: ", stringify!(VRActiveActionSet_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRActiveActionSet_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VRActiveActionSet_t))
    );
    fn test_field_ulActionSet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRActiveActionSet_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ulActionSet) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRActiveActionSet_t),
                "::",
                stringify!(ulActionSet)
            )
        );
    }
    test_field_ulActionSet();
    fn test_field_ulRestrictedToDevice() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRActiveActionSet_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ulRestrictedToDevice) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VRActiveActionSet_t),
                "::",
                stringify!(ulRestrictedToDevice)
            )
        );
    }
    test_field_ulRestrictedToDevice();
    fn test_field_ulSecondaryActionSet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRActiveActionSet_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ulSecondaryActionSet) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VRActiveActionSet_t),
                "::",
                stringify!(ulSecondaryActionSet)
            )
        );
    }
    test_field_ulSecondaryActionSet();
    fn test_field_unPadding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRActiveActionSet_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unPadding) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VRActiveActionSet_t),
                "::",
                stringify!(unPadding)
            )
        );
    }
    test_field_unPadding();
    fn test_field_nPriority() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRActiveActionSet_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nPriority) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VRActiveActionSet_t),
                "::",
                stringify!(nPriority)
            )
        );
    }
    test_field_nPriority();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VRSkeletalSummaryData_t {
    pub flFingerCurl: [f32; 5usize],
    pub flFingerSplay: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_VRSkeletalSummaryData_t() {
    assert_eq!(
        ::std::mem::size_of::<VRSkeletalSummaryData_t>(),
        36usize,
        concat!("Size of: ", stringify!(VRSkeletalSummaryData_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VRSkeletalSummaryData_t>(),
        4usize,
        concat!("Alignment of ", stringify!(VRSkeletalSummaryData_t))
    );
    fn test_field_flFingerCurl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRSkeletalSummaryData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flFingerCurl) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VRSkeletalSummaryData_t),
                "::",
                stringify!(flFingerCurl)
            )
        );
    }
    test_field_flFingerCurl();
    fn test_field_flFingerSplay() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VRSkeletalSummaryData_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flFingerSplay) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VRSkeletalSummaryData_t),
                "::",
                stringify!(flFingerSplay)
            )
        );
    }
    test_field_flFingerSplay();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SpatialAnchorPose_t {
    pub mAnchorToAbsoluteTracking: HmdMatrix34_t,
}
#[test]
fn bindgen_test_layout_SpatialAnchorPose_t() {
    assert_eq!(
        ::std::mem::size_of::<SpatialAnchorPose_t>(),
        48usize,
        concat!("Size of: ", stringify!(SpatialAnchorPose_t))
    );
    assert_eq!(
        ::std::mem::align_of::<SpatialAnchorPose_t>(),
        4usize,
        concat!("Alignment of ", stringify!(SpatialAnchorPose_t))
    );
    fn test_field_mAnchorToAbsoluteTracking() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<SpatialAnchorPose_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mAnchorToAbsoluteTracking) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SpatialAnchorPose_t),
                "::",
                stringify!(mAnchorToAbsoluteTracking)
            )
        );
    }
    test_field_mAnchorToAbsoluteTracking();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct COpenVRContext {
    pub m_pVRSystem: isize,
    pub m_pVRChaperone: isize,
    pub m_pVRChaperoneSetup: isize,
    pub m_pVRCompositor: isize,
    pub m_pVROverlay: isize,
    pub m_pVRResources: isize,
    pub m_pVRRenderModels: isize,
    pub m_pVRExtendedDisplay: isize,
    pub m_pVRSettings: isize,
    pub m_pVRApplications: isize,
    pub m_pVRTrackedCamera: isize,
    pub m_pVRScreenshots: isize,
    pub m_pVRDriverManager: isize,
    pub m_pVRInput: isize,
    pub m_pVRIOBuffer: isize,
    pub m_pVRSpatialAnchors: isize,
    pub m_pVRNotifications: isize,
}
#[test]
fn bindgen_test_layout_COpenVRContext() {
    assert_eq!(
        ::std::mem::size_of::<COpenVRContext>(),
        136usize,
        concat!("Size of: ", stringify!(COpenVRContext))
    );
    assert_eq!(
        ::std::mem::align_of::<COpenVRContext>(),
        8usize,
        concat!("Alignment of ", stringify!(COpenVRContext))
    );
    fn test_field_m_pVRSystem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRSystem) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRSystem)
            )
        );
    }
    test_field_m_pVRSystem();
    fn test_field_m_pVRChaperone() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRChaperone) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRChaperone)
            )
        );
    }
    test_field_m_pVRChaperone();
    fn test_field_m_pVRChaperoneSetup() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRChaperoneSetup) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRChaperoneSetup)
            )
        );
    }
    test_field_m_pVRChaperoneSetup();
    fn test_field_m_pVRCompositor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRCompositor) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRCompositor)
            )
        );
    }
    test_field_m_pVRCompositor();
    fn test_field_m_pVROverlay() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVROverlay) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVROverlay)
            )
        );
    }
    test_field_m_pVROverlay();
    fn test_field_m_pVRResources() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRResources) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRResources)
            )
        );
    }
    test_field_m_pVRResources();
    fn test_field_m_pVRRenderModels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRRenderModels) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRRenderModels)
            )
        );
    }
    test_field_m_pVRRenderModels();
    fn test_field_m_pVRExtendedDisplay() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRExtendedDisplay) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRExtendedDisplay)
            )
        );
    }
    test_field_m_pVRExtendedDisplay();
    fn test_field_m_pVRSettings() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRSettings) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRSettings)
            )
        );
    }
    test_field_m_pVRSettings();
    fn test_field_m_pVRApplications() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRApplications) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRApplications)
            )
        );
    }
    test_field_m_pVRApplications();
    fn test_field_m_pVRTrackedCamera() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRTrackedCamera) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRTrackedCamera)
            )
        );
    }
    test_field_m_pVRTrackedCamera();
    fn test_field_m_pVRScreenshots() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRScreenshots) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRScreenshots)
            )
        );
    }
    test_field_m_pVRScreenshots();
    fn test_field_m_pVRDriverManager() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRDriverManager) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRDriverManager)
            )
        );
    }
    test_field_m_pVRDriverManager();
    fn test_field_m_pVRInput() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRInput) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRInput)
            )
        );
    }
    test_field_m_pVRInput();
    fn test_field_m_pVRIOBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRIOBuffer) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRIOBuffer)
            )
        );
    }
    test_field_m_pVRIOBuffer();
    fn test_field_m_pVRSpatialAnchors() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRSpatialAnchors) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRSpatialAnchors)
            )
        );
    }
    test_field_m_pVRSpatialAnchors();
    fn test_field_m_pVRNotifications() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<COpenVRContext>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_pVRNotifications) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(COpenVRContext),
                "::",
                stringify!(m_pVRNotifications)
            )
        );
    }
    test_field_m_pVRNotifications();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union VREvent_Data_t {
    pub reserved: VREvent_Reserved_t,
    pub controller: VREvent_Controller_t,
    pub mouse: VREvent_Mouse_t,
    pub scroll: VREvent_Scroll_t,
    pub process: VREvent_Process_t,
    pub notification: VREvent_Notification_t,
    pub overlay: VREvent_Overlay_t,
    pub status: VREvent_Status_t,
    pub keyboard: VREvent_Keyboard_t,
    pub ipd: VREvent_Ipd_t,
    pub chaperone: VREvent_Chaperone_t,
    pub performanceTest: VREvent_PerformanceTest_t,
    pub touchPadMove: VREvent_TouchPadMove_t,
    pub seatedZeroPoseReset: VREvent_SeatedZeroPoseReset_t,
    pub screenshot: VREvent_Screenshot_t,
    pub screenshotProgress: VREvent_ScreenshotProgress_t,
    pub applicationLaunch: VREvent_ApplicationLaunch_t,
    pub cameraSurface: VREvent_EditingCameraSurface_t,
    pub messageOverlay: VREvent_MessageOverlay_t,
    pub property: VREvent_Property_t,
    pub dualAnalog: VREvent_DualAnalog_t,
    pub hapticVibration: VREvent_HapticVibration_t,
    pub webConsole: VREvent_WebConsole_t,
    pub inputBinding: VREvent_InputBindingLoad_t,
    pub actionManifest: VREvent_InputActionManifestLoad_t,
    pub spatialAnchor: VREvent_SpatialAnchor_t,
}
#[test]
fn bindgen_test_layout_VREvent_Data_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_Data_t>(),
        48usize,
        concat!("Size of: ", stringify!(VREvent_Data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_Data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_Data_t))
    );
    fn test_field_reserved() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(reserved)
            )
        );
    }
    test_field_reserved();
    fn test_field_controller() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).controller) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(controller)
            )
        );
    }
    test_field_controller();
    fn test_field_mouse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mouse) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(mouse)
            )
        );
    }
    test_field_mouse();
    fn test_field_scroll() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).scroll) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(scroll)
            )
        );
    }
    test_field_scroll();
    fn test_field_process() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).process) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(process)
            )
        );
    }
    test_field_process();
    fn test_field_notification() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).notification) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(notification)
            )
        );
    }
    test_field_notification();
    fn test_field_overlay() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).overlay) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(overlay)
            )
        );
    }
    test_field_overlay();
    fn test_field_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(status)
            )
        );
    }
    test_field_status();
    fn test_field_keyboard() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).keyboard) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(keyboard)
            )
        );
    }
    test_field_keyboard();
    fn test_field_ipd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ipd) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(ipd)
            )
        );
    }
    test_field_ipd();
    fn test_field_chaperone() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).chaperone) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(chaperone)
            )
        );
    }
    test_field_chaperone();
    fn test_field_performanceTest() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).performanceTest) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(performanceTest)
            )
        );
    }
    test_field_performanceTest();
    fn test_field_touchPadMove() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).touchPadMove) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(touchPadMove)
            )
        );
    }
    test_field_touchPadMove();
    fn test_field_seatedZeroPoseReset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).seatedZeroPoseReset) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(seatedZeroPoseReset)
            )
        );
    }
    test_field_seatedZeroPoseReset();
    fn test_field_screenshot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).screenshot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(screenshot)
            )
        );
    }
    test_field_screenshot();
    fn test_field_screenshotProgress() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).screenshotProgress) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(screenshotProgress)
            )
        );
    }
    test_field_screenshotProgress();
    fn test_field_applicationLaunch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).applicationLaunch) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(applicationLaunch)
            )
        );
    }
    test_field_applicationLaunch();
    fn test_field_cameraSurface() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cameraSurface) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(cameraSurface)
            )
        );
    }
    test_field_cameraSurface();
    fn test_field_messageOverlay() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).messageOverlay) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(messageOverlay)
            )
        );
    }
    test_field_messageOverlay();
    fn test_field_property() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).property) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(property)
            )
        );
    }
    test_field_property();
    fn test_field_dualAnalog() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dualAnalog) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(dualAnalog)
            )
        );
    }
    test_field_dualAnalog();
    fn test_field_hapticVibration() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hapticVibration) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(hapticVibration)
            )
        );
    }
    test_field_hapticVibration();
    fn test_field_webConsole() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).webConsole) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(webConsole)
            )
        );
    }
    test_field_webConsole();
    fn test_field_inputBinding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).inputBinding) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(inputBinding)
            )
        );
    }
    test_field_inputBinding();
    fn test_field_actionManifest() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).actionManifest) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(actionManifest)
            )
        );
    }
    test_field_actionManifest();
    fn test_field_spatialAnchor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spatialAnchor) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_Data_t),
                "::",
                stringify!(spatialAnchor)
            )
        );
    }
    test_field_spatialAnchor();
}
#[doc = " An event posted by the server to all running applications"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct VREvent_t {
    pub eventType: u32,
    pub trackedDeviceIndex: TrackedDeviceIndex_t,
    pub eventAgeSeconds: f32,
    pub data: VREvent_Data_t,
}
#[test]
fn bindgen_test_layout_VREvent_t() {
    assert_eq!(
        ::std::mem::size_of::<VREvent_t>(),
        64usize,
        concat!("Size of: ", stringify!(VREvent_t))
    );
    assert_eq!(
        ::std::mem::align_of::<VREvent_t>(),
        8usize,
        concat!("Alignment of ", stringify!(VREvent_t))
    );
    fn test_field_eventType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_t),
                "::",
                stringify!(eventType)
            )
        );
    }
    test_field_eventType();
    fn test_field_trackedDeviceIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trackedDeviceIndex) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_t),
                "::",
                stringify!(trackedDeviceIndex)
            )
        );
    }
    test_field_trackedDeviceIndex();
    fn test_field_eventAgeSeconds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).eventAgeSeconds) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_t),
                "::",
                stringify!(eventAgeSeconds)
            )
        );
    }
    test_field_eventAgeSeconds();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VREvent_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VREvent_t),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union VROverlayIntersectionMaskPrimitive_Data_t {
    pub m_Rectangle: IntersectionMaskRectangle_t,
    pub m_Circle: IntersectionMaskCircle_t,
}
#[test]
fn bindgen_test_layout_VROverlayIntersectionMaskPrimitive_Data_t() {
    assert_eq!(
        ::std::mem::size_of::<VROverlayIntersectionMaskPrimitive_Data_t>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(VROverlayIntersectionMaskPrimitive_Data_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<VROverlayIntersectionMaskPrimitive_Data_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(VROverlayIntersectionMaskPrimitive_Data_t)
        )
    );
    fn test_field_m_Rectangle() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VROverlayIntersectionMaskPrimitive_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Rectangle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionMaskPrimitive_Data_t),
                "::",
                stringify!(m_Rectangle)
            )
        );
    }
    test_field_m_Rectangle();
    fn test_field_m_Circle() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VROverlayIntersectionMaskPrimitive_Data_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Circle) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionMaskPrimitive_Data_t),
                "::",
                stringify!(m_Circle)
            )
        );
    }
    test_field_m_Circle();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct VROverlayIntersectionMaskPrimitive_t {
    pub m_nPrimitiveType: EVROverlayIntersectionMaskPrimitiveType,
    pub m_Primitive: VROverlayIntersectionMaskPrimitive_Data_t,
}
#[test]
fn bindgen_test_layout_VROverlayIntersectionMaskPrimitive_t() {
    assert_eq!(
        ::std::mem::size_of::<VROverlayIntersectionMaskPrimitive_t>(),
        20usize,
        concat!(
            "Size of: ",
            stringify!(VROverlayIntersectionMaskPrimitive_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<VROverlayIntersectionMaskPrimitive_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(VROverlayIntersectionMaskPrimitive_t)
        )
    );
    fn test_field_m_nPrimitiveType() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VROverlayIntersectionMaskPrimitive_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_nPrimitiveType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionMaskPrimitive_t),
                "::",
                stringify!(m_nPrimitiveType)
            )
        );
    }
    test_field_m_nPrimitiveType();
    fn test_field_m_Primitive() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<VROverlayIntersectionMaskPrimitive_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).m_Primitive) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VROverlayIntersectionMaskPrimitive_t),
                "::",
                stringify!(m_Primitive)
            )
        );
    }
    test_field_m_Primitive();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VR_IVRSystem_FnTable {
    pub GetRecommendedRenderTargetSize:
        ::std::option::Option<unsafe extern "C" fn(pnWidth: *mut u32, pnHeight: *mut u32)>,
    pub GetProjectionMatrix: ::std::option::Option<
        unsafe extern "C" fn(eEye: EVREye, fNearZ: f32, fFarZ: f32) -> HmdMatrix44_t,
    >,
    pub GetProjectionRaw: ::std::option::Option<
        unsafe extern "C" fn(
            eEye: EVREye,
            pfLeft: *mut f32,
            pfRight: *mut f32,
            pfTop: *mut f32,
            pfBottom: *mut f32,
        ),
    >,
    pub ComputeDistortion: ::std::option::Option<
        unsafe extern "C" fn(
            eEye: EVREye,
            fU: f32,
            fV: f32,
            pDistortionCoordinates: *mut DistortionCoordinates_t,
        ) -> bool,
    >,
    pub GetEyeToHeadTransform:
        ::std::option::Option<unsafe extern "C" fn(eEye: EVREye) -> HmdMatrix34_t>,
    pub GetTimeSinceLastVsync: ::std::option::Option<
        unsafe extern "C" fn(pfSecondsSinceLastVsync: *mut f32, pulFrameCounter: *mut u64) -> bool,
    >,
    pub GetD3D9AdapterIndex: ::std::option::Option<unsafe extern "C" fn() -> i32>,
    pub GetDXGIOutputInfo: ::std::option::Option<unsafe extern "C" fn(pnAdapterIndex: *mut i32)>,
    pub GetOutputDevice: ::std::option::Option<
        unsafe extern "C" fn(
            pnDevice: *mut u64,
            textureType: ETextureType,
            pInstance: *mut VkInstance_T,
        ),
    >,
    pub IsDisplayOnDesktop: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub SetDisplayVisibility:
        ::std::option::Option<unsafe extern "C" fn(bIsVisibleOnDesktop: bool) -> bool>,
    pub GetDeviceToAbsoluteTrackingPose: ::std::option::Option<
        unsafe extern "C" fn(
            eOrigin: ETrackingUniverseOrigin,
            fPredictedSecondsToPhotonsFromNow: f32,
            pTrackedDevicePoseArray: *mut TrackedDevicePose_t,
            unTrackedDevicePoseArrayCount: u32,
        ),
    >,
    pub ResetSeatedZeroPose: ::std::option::Option<unsafe extern "C" fn()>,
    pub GetSeatedZeroPoseToStandingAbsoluteTrackingPose:
        ::std::option::Option<unsafe extern "C" fn() -> HmdMatrix34_t>,
    pub GetRawZeroPoseToStandingAbsoluteTrackingPose:
        ::std::option::Option<unsafe extern "C" fn() -> HmdMatrix34_t>,
    pub GetSortedTrackedDeviceIndicesOfClass: ::std::option::Option<
        unsafe extern "C" fn(
            eTrackedDeviceClass: ETrackedDeviceClass,
            punTrackedDeviceIndexArray: *mut TrackedDeviceIndex_t,
            unTrackedDeviceIndexArrayCount: u32,
            unRelativeToTrackedDeviceIndex: TrackedDeviceIndex_t,
        ) -> u32,
    >,
    pub GetTrackedDeviceActivityLevel: ::std::option::Option<
        unsafe extern "C" fn(unDeviceId: TrackedDeviceIndex_t) -> EDeviceActivityLevel,
    >,
    pub ApplyTransform: ::std::option::Option<
        unsafe extern "C" fn(
            pOutputPose: *mut TrackedDevicePose_t,
            pTrackedDevicePose: *mut TrackedDevicePose_t,
            pTransform: *mut HmdMatrix34_t,
        ),
    >,
    pub GetTrackedDeviceIndexForControllerRole: ::std::option::Option<
        unsafe extern "C" fn(unDeviceType: ETrackedControllerRole) -> TrackedDeviceIndex_t,
    >,
    pub GetControllerRoleForTrackedDeviceIndex: ::std::option::Option<
        unsafe extern "C" fn(unDeviceIndex: TrackedDeviceIndex_t) -> ETrackedControllerRole,
    >,
    pub GetTrackedDeviceClass: ::std::option::Option<
        unsafe extern "C" fn(unDeviceIndex: TrackedDeviceIndex_t) -> ETrackedDeviceClass,
    >,
    pub IsTrackedDeviceConnected:
        ::std::option::Option<unsafe extern "C" fn(unDeviceIndex: TrackedDeviceIndex_t) -> bool>,
    pub GetBoolTrackedDeviceProperty: ::std::option::Option<
        unsafe extern "C" fn(
            unDeviceIndex: TrackedDeviceIndex_t,
            prop: ETrackedDeviceProperty,
            pError: *mut ETrackedPropertyError,
        ) -> bool,
    >,
    pub GetFloatTrackedDeviceProperty: ::std::option::Option<
        unsafe extern "C" fn(
            unDeviceIndex: TrackedDeviceIndex_t,
            prop: ETrackedDeviceProperty,
            pError: *mut ETrackedPropertyError,
        ) -> f32,
    >,
    pub GetInt32TrackedDeviceProperty: ::std::option::Option<
        unsafe extern "C" fn(
            unDeviceIndex: TrackedDeviceIndex_t,
            prop: ETrackedDeviceProperty,
            pError: *mut ETrackedPropertyError,
        ) -> i32,
    >,
    pub GetUint64TrackedDeviceProperty: ::std::option::Option<
        unsafe extern "C" fn(
            unDeviceIndex: TrackedDeviceIndex_t,
            prop: ETrackedDeviceProperty,
            pError: *mut ETrackedPropertyError,
        ) -> u64,
    >,
    pub GetMatrix34TrackedDeviceProperty: ::std::option::Option<
        unsafe extern "C" fn(
            unDeviceIndex: TrackedDeviceIndex_t,
            prop: ETrackedDeviceProperty,
            pError: *mut ETrackedPropertyError,
        ) -> HmdMatrix34_t,
    >,
    pub GetArrayTrackedDeviceProperty: ::std::option::Option<
        unsafe extern "C" fn(
            unDeviceIndex: TrackedDeviceIndex_t,
            prop: ETrackedDeviceProperty,
            propType: PropertyTypeTag_t,
            pBuffer: *mut ::std::os::raw::c_void,
            unBufferSize: u32,
            pError: *mut ETrackedPropertyError,
        ) -> u32,
    >,
    pub GetStringTrackedDeviceProperty: ::std::option::Option<
        unsafe extern "C" fn(
            unDeviceIndex: TrackedDeviceIndex_t,
            prop: ETrackedDeviceProperty,
            pchValue: *mut ::std::os::raw::c_char,
            unBufferSize: u32,
            pError: *mut ETrackedPropertyError,
        ) -> u32,
    >,
    pub GetPropErrorNameFromEnum: ::std::option::Option<
        unsafe extern "C" fn(error: ETrackedPropertyError) -> *mut ::std::os::raw::c_char,
    >,
    pub PollNextEvent: ::std::option::Option<
        unsafe extern "C" fn(pEvent: *mut VREvent_t, uncbVREvent: u32) -> bool,
    >,
    pub PollNextEventWithPose: ::std::option::Option<
        unsafe extern "C" fn(
            eOrigin: ETrackingUniverseOrigin,
            pEvent: *mut VREvent_t,
            uncbVREvent: u32,
            pTrackedDevicePose: *mut TrackedDevicePose_t,
        ) -> bool,
    >,
    pub GetEventTypeNameFromEnum: ::std::option::Option<
        unsafe extern "C" fn(eType: EVREventType) -> *mut ::std::os::raw::c_char,
    >,
    pub GetHiddenAreaMesh: ::std::option::Option<
        unsafe extern "C" fn(eEye: EVREye, type_: EHiddenAreaMeshType) -> HiddenAreaMesh_t,
    >,
    pub GetControllerState: ::std::option::Option<
        unsafe extern "C" fn(
            unControllerDeviceIndex: TrackedDeviceIndex_t,
            pControllerState: *mut VRControllerState_t,
            unControllerStateSize: u32,
        ) -> bool,
    >,
    pub GetControllerStateWithPose: ::std::option::Option<
        unsafe extern "C" fn(
            eOrigin: ETrackingUniverseOrigin,
            unControllerDeviceIndex: TrackedDeviceIndex_t,
            pControllerState: *mut VRControllerState_t,
            unControllerStateSize: u32,
            pTrackedDevicePose: *mut TrackedDevicePose_t,
        ) -> bool,
    >,
    pub TriggerHapticPulse: ::std::option::Option<
        unsafe extern "C" fn(
            unControllerDeviceIndex: TrackedDeviceIndex_t,
            unAxisId: u32,
            usDurationMicroSec: ::std::os::raw::c_ushort,
        ),
    >,
    pub GetButtonIdNameFromEnum: ::std::option::Option<
        unsafe extern "C" fn(eButtonId: EVRButtonId) -> *mut ::std::os::raw::c_char,
    >,
    pub GetControllerAxisTypeNameFromEnum: ::std::option::Option<
        unsafe extern "C" fn(eAxisType: EVRControllerAxisType) -> *mut ::std::os::raw::c_char,
    >,
    pub IsInputAvailable: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub IsSteamVRDrawingControllers: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub ShouldApplicationPause: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub ShouldApplicationReduceRenderingWork: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub DriverDebugRequest: ::std::option::Option<
        unsafe extern "C" fn(
            unDeviceIndex: TrackedDeviceIndex_t,
            pchRequest: *mut ::std::os::raw::c_char,
            pchResponseBuffer: *mut ::std::os::raw::c_char,
            unResponseBufferSize: u32,
        ) -> u32,
    >,
    pub PerformFirmwareUpdate: ::std::option::Option<
        unsafe extern "C" fn(unDeviceIndex: TrackedDeviceIndex_t) -> EVRFirmwareError,
    >,
    pub AcknowledgeQuit_Exiting: ::std::option::Option<unsafe extern "C" fn()>,
    pub AcknowledgeQuit_UserPrompt: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_VR_IVRSystem_FnTable() {
    assert_eq!(
        ::std::mem::size_of::<VR_IVRSystem_FnTable>(),
        376usize,
        concat!("Size of: ", stringify!(VR_IVRSystem_FnTable))
    );
    assert_eq!(
        ::std::mem::align_of::<VR_IVRSystem_FnTable>(),
        8usize,
        concat!("Alignment of ", stringify!(VR_IVRSystem_FnTable))
    );
    fn test_field_GetRecommendedRenderTargetSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetRecommendedRenderTargetSize) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetRecommendedRenderTargetSize)
            )
        );
    }
    test_field_GetRecommendedRenderTargetSize();
    fn test_field_GetProjectionMatrix() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetProjectionMatrix) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetProjectionMatrix)
            )
        );
    }
    test_field_GetProjectionMatrix();
    fn test_field_GetProjectionRaw() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetProjectionRaw) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetProjectionRaw)
            )
        );
    }
    test_field_GetProjectionRaw();
    fn test_field_ComputeDistortion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ComputeDistortion) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(ComputeDistortion)
            )
        );
    }
    test_field_ComputeDistortion();
    fn test_field_GetEyeToHeadTransform() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetEyeToHeadTransform) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetEyeToHeadTransform)
            )
        );
    }
    test_field_GetEyeToHeadTransform();
    fn test_field_GetTimeSinceLastVsync() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTimeSinceLastVsync) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetTimeSinceLastVsync)
            )
        );
    }
    test_field_GetTimeSinceLastVsync();
    fn test_field_GetD3D9AdapterIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetD3D9AdapterIndex) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetD3D9AdapterIndex)
            )
        );
    }
    test_field_GetD3D9AdapterIndex();
    fn test_field_GetDXGIOutputInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetDXGIOutputInfo) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetDXGIOutputInfo)
            )
        );
    }
    test_field_GetDXGIOutputInfo();
    fn test_field_GetOutputDevice() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetOutputDevice) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetOutputDevice)
            )
        );
    }
    test_field_GetOutputDevice();
    fn test_field_IsDisplayOnDesktop() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IsDisplayOnDesktop) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(IsDisplayOnDesktop)
            )
        );
    }
    test_field_IsDisplayOnDesktop();
    fn test_field_SetDisplayVisibility() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetDisplayVisibility) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(SetDisplayVisibility)
            )
        );
    }
    test_field_SetDisplayVisibility();
    fn test_field_GetDeviceToAbsoluteTrackingPose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetDeviceToAbsoluteTrackingPose) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetDeviceToAbsoluteTrackingPose)
            )
        );
    }
    test_field_GetDeviceToAbsoluteTrackingPose();
    fn test_field_ResetSeatedZeroPose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ResetSeatedZeroPose) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(ResetSeatedZeroPose)
            )
        );
    }
    test_field_ResetSeatedZeroPose();
    fn test_field_GetSeatedZeroPoseToStandingAbsoluteTrackingPose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetSeatedZeroPoseToStandingAbsoluteTrackingPose)
                    as usize
                    - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetSeatedZeroPoseToStandingAbsoluteTrackingPose)
            )
        );
    }
    test_field_GetSeatedZeroPoseToStandingAbsoluteTrackingPose();
    fn test_field_GetRawZeroPoseToStandingAbsoluteTrackingPose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetRawZeroPoseToStandingAbsoluteTrackingPose) as usize
                    - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetRawZeroPoseToStandingAbsoluteTrackingPose)
            )
        );
    }
    test_field_GetRawZeroPoseToStandingAbsoluteTrackingPose();
    fn test_field_GetSortedTrackedDeviceIndicesOfClass() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetSortedTrackedDeviceIndicesOfClass) as usize
                    - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetSortedTrackedDeviceIndicesOfClass)
            )
        );
    }
    test_field_GetSortedTrackedDeviceIndicesOfClass();
    fn test_field_GetTrackedDeviceActivityLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTrackedDeviceActivityLevel) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetTrackedDeviceActivityLevel)
            )
        );
    }
    test_field_GetTrackedDeviceActivityLevel();
    fn test_field_ApplyTransform() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ApplyTransform) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(ApplyTransform)
            )
        );
    }
    test_field_ApplyTransform();
    fn test_field_GetTrackedDeviceIndexForControllerRole() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTrackedDeviceIndexForControllerRole) as usize
                    - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetTrackedDeviceIndexForControllerRole)
            )
        );
    }
    test_field_GetTrackedDeviceIndexForControllerRole();
    fn test_field_GetControllerRoleForTrackedDeviceIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetControllerRoleForTrackedDeviceIndex) as usize
                    - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetControllerRoleForTrackedDeviceIndex)
            )
        );
    }
    test_field_GetControllerRoleForTrackedDeviceIndex();
    fn test_field_GetTrackedDeviceClass() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTrackedDeviceClass) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetTrackedDeviceClass)
            )
        );
    }
    test_field_GetTrackedDeviceClass();
    fn test_field_IsTrackedDeviceConnected() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IsTrackedDeviceConnected) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(IsTrackedDeviceConnected)
            )
        );
    }
    test_field_IsTrackedDeviceConnected();
    fn test_field_GetBoolTrackedDeviceProperty() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetBoolTrackedDeviceProperty) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetBoolTrackedDeviceProperty)
            )
        );
    }
    test_field_GetBoolTrackedDeviceProperty();
    fn test_field_GetFloatTrackedDeviceProperty() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetFloatTrackedDeviceProperty) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetFloatTrackedDeviceProperty)
            )
        );
    }
    test_field_GetFloatTrackedDeviceProperty();
    fn test_field_GetInt32TrackedDeviceProperty() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetInt32TrackedDeviceProperty) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetInt32TrackedDeviceProperty)
            )
        );
    }
    test_field_GetInt32TrackedDeviceProperty();
    fn test_field_GetUint64TrackedDeviceProperty() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetUint64TrackedDeviceProperty) as usize - ptr as usize
            },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetUint64TrackedDeviceProperty)
            )
        );
    }
    test_field_GetUint64TrackedDeviceProperty();
    fn test_field_GetMatrix34TrackedDeviceProperty() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetMatrix34TrackedDeviceProperty) as usize
                    - ptr as usize
            },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetMatrix34TrackedDeviceProperty)
            )
        );
    }
    test_field_GetMatrix34TrackedDeviceProperty();
    fn test_field_GetArrayTrackedDeviceProperty() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetArrayTrackedDeviceProperty) as usize - ptr as usize
            },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetArrayTrackedDeviceProperty)
            )
        );
    }
    test_field_GetArrayTrackedDeviceProperty();
    fn test_field_GetStringTrackedDeviceProperty() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetStringTrackedDeviceProperty) as usize - ptr as usize
            },
            224usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetStringTrackedDeviceProperty)
            )
        );
    }
    test_field_GetStringTrackedDeviceProperty();
    fn test_field_GetPropErrorNameFromEnum() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetPropErrorNameFromEnum) as usize - ptr as usize
            },
            232usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetPropErrorNameFromEnum)
            )
        );
    }
    test_field_GetPropErrorNameFromEnum();
    fn test_field_PollNextEvent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).PollNextEvent) as usize - ptr as usize
            },
            240usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(PollNextEvent)
            )
        );
    }
    test_field_PollNextEvent();
    fn test_field_PollNextEventWithPose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).PollNextEventWithPose) as usize - ptr as usize
            },
            248usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(PollNextEventWithPose)
            )
        );
    }
    test_field_PollNextEventWithPose();
    fn test_field_GetEventTypeNameFromEnum() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetEventTypeNameFromEnum) as usize - ptr as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetEventTypeNameFromEnum)
            )
        );
    }
    test_field_GetEventTypeNameFromEnum();
    fn test_field_GetHiddenAreaMesh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetHiddenAreaMesh) as usize - ptr as usize
            },
            264usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetHiddenAreaMesh)
            )
        );
    }
    test_field_GetHiddenAreaMesh();
    fn test_field_GetControllerState() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetControllerState) as usize - ptr as usize
            },
            272usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetControllerState)
            )
        );
    }
    test_field_GetControllerState();
    fn test_field_GetControllerStateWithPose() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetControllerStateWithPose) as usize - ptr as usize
            },
            280usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetControllerStateWithPose)
            )
        );
    }
    test_field_GetControllerStateWithPose();
    fn test_field_TriggerHapticPulse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TriggerHapticPulse) as usize - ptr as usize
            },
            288usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(TriggerHapticPulse)
            )
        );
    }
    test_field_TriggerHapticPulse();
    fn test_field_GetButtonIdNameFromEnum() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetButtonIdNameFromEnum) as usize - ptr as usize
            },
            296usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetButtonIdNameFromEnum)
            )
        );
    }
    test_field_GetButtonIdNameFromEnum();
    fn test_field_GetControllerAxisTypeNameFromEnum() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetControllerAxisTypeNameFromEnum) as usize
                    - ptr as usize
            },
            304usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(GetControllerAxisTypeNameFromEnum)
            )
        );
    }
    test_field_GetControllerAxisTypeNameFromEnum();
    fn test_field_IsInputAvailable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IsInputAvailable) as usize - ptr as usize
            },
            312usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(IsInputAvailable)
            )
        );
    }
    test_field_IsInputAvailable();
    fn test_field_IsSteamVRDrawingControllers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IsSteamVRDrawingControllers) as usize - ptr as usize
            },
            320usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(IsSteamVRDrawingControllers)
            )
        );
    }
    test_field_IsSteamVRDrawingControllers();
    fn test_field_ShouldApplicationPause() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ShouldApplicationPause) as usize - ptr as usize
            },
            328usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(ShouldApplicationPause)
            )
        );
    }
    test_field_ShouldApplicationPause();
    fn test_field_ShouldApplicationReduceRenderingWork() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ShouldApplicationReduceRenderingWork) as usize
                    - ptr as usize
            },
            336usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(ShouldApplicationReduceRenderingWork)
            )
        );
    }
    test_field_ShouldApplicationReduceRenderingWork();
    fn test_field_DriverDebugRequest() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DriverDebugRequest) as usize - ptr as usize
            },
            344usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(DriverDebugRequest)
            )
        );
    }
    test_field_DriverDebugRequest();
    fn test_field_PerformFirmwareUpdate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).PerformFirmwareUpdate) as usize - ptr as usize
            },
            352usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(PerformFirmwareUpdate)
            )
        );
    }
    test_field_PerformFirmwareUpdate();
    fn test_field_AcknowledgeQuit_Exiting() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AcknowledgeQuit_Exiting) as usize - ptr as usize
            },
            360usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(AcknowledgeQuit_Exiting)
            )
        );
    }
    test_field_AcknowledgeQuit_Exiting();
    fn test_field_AcknowledgeQuit_UserPrompt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRSystem_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AcknowledgeQuit_UserPrompt) as usize - ptr as usize
            },
            368usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRSystem_FnTable),
                "::",
                stringify!(AcknowledgeQuit_UserPrompt)
            )
        );
    }
    test_field_AcknowledgeQuit_UserPrompt();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VR_IVRExtendedDisplay_FnTable {
    pub GetWindowBounds: ::std::option::Option<
        unsafe extern "C" fn(pnX: *mut i32, pnY: *mut i32, pnWidth: *mut u32, pnHeight: *mut u32),
    >,
    pub GetEyeOutputViewport: ::std::option::Option<
        unsafe extern "C" fn(
            eEye: EVREye,
            pnX: *mut u32,
            pnY: *mut u32,
            pnWidth: *mut u32,
            pnHeight: *mut u32,
        ),
    >,
    pub GetDXGIOutputInfo: ::std::option::Option<
        unsafe extern "C" fn(pnAdapterIndex: *mut i32, pnAdapterOutputIndex: *mut i32),
    >,
}
#[test]
fn bindgen_test_layout_VR_IVRExtendedDisplay_FnTable() {
    assert_eq!(
        ::std::mem::size_of::<VR_IVRExtendedDisplay_FnTable>(),
        24usize,
        concat!("Size of: ", stringify!(VR_IVRExtendedDisplay_FnTable))
    );
    assert_eq!(
        ::std::mem::align_of::<VR_IVRExtendedDisplay_FnTable>(),
        8usize,
        concat!("Alignment of ", stringify!(VR_IVRExtendedDisplay_FnTable))
    );
    fn test_field_GetWindowBounds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRExtendedDisplay_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetWindowBounds) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRExtendedDisplay_FnTable),
                "::",
                stringify!(GetWindowBounds)
            )
        );
    }
    test_field_GetWindowBounds();
    fn test_field_GetEyeOutputViewport() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRExtendedDisplay_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetEyeOutputViewport) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRExtendedDisplay_FnTable),
                "::",
                stringify!(GetEyeOutputViewport)
            )
        );
    }
    test_field_GetEyeOutputViewport();
    fn test_field_GetDXGIOutputInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRExtendedDisplay_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetDXGIOutputInfo) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRExtendedDisplay_FnTable),
                "::",
                stringify!(GetDXGIOutputInfo)
            )
        );
    }
    test_field_GetDXGIOutputInfo();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VR_IVRTrackedCamera_FnTable {
    pub GetCameraErrorNameFromEnum: ::std::option::Option<
        unsafe extern "C" fn(eCameraError: EVRTrackedCameraError) -> *mut ::std::os::raw::c_char,
    >,
    pub HasCamera: ::std::option::Option<
        unsafe extern "C" fn(
            nDeviceIndex: TrackedDeviceIndex_t,
            pHasCamera: *mut bool,
        ) -> EVRTrackedCameraError,
    >,
    pub GetCameraFrameSize: ::std::option::Option<
        unsafe extern "C" fn(
            nDeviceIndex: TrackedDeviceIndex_t,
            eFrameType: EVRTrackedCameraFrameType,
            pnWidth: *mut u32,
            pnHeight: *mut u32,
            pnFrameBufferSize: *mut u32,
        ) -> EVRTrackedCameraError,
    >,
    pub GetCameraIntrinsics: ::std::option::Option<
        unsafe extern "C" fn(
            nDeviceIndex: TrackedDeviceIndex_t,
            nCameraIndex: u32,
            eFrameType: EVRTrackedCameraFrameType,
            pFocalLength: *mut HmdVector2_t,
            pCenter: *mut HmdVector2_t,
        ) -> EVRTrackedCameraError,
    >,
    pub GetCameraProjection: ::std::option::Option<
        unsafe extern "C" fn(
            nDeviceIndex: TrackedDeviceIndex_t,
            nCameraIndex: u32,
            eFrameType: EVRTrackedCameraFrameType,
            flZNear: f32,
            flZFar: f32,
            pProjection: *mut HmdMatrix44_t,
        ) -> EVRTrackedCameraError,
    >,
    pub AcquireVideoStreamingService: ::std::option::Option<
        unsafe extern "C" fn(
            nDeviceIndex: TrackedDeviceIndex_t,
            pHandle: *mut TrackedCameraHandle_t,
        ) -> EVRTrackedCameraError,
    >,
    pub ReleaseVideoStreamingService: ::std::option::Option<
        unsafe extern "C" fn(hTrackedCamera: TrackedCameraHandle_t) -> EVRTrackedCameraError,
    >,
    pub GetVideoStreamFrameBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            hTrackedCamera: TrackedCameraHandle_t,
            eFrameType: EVRTrackedCameraFrameType,
            pFrameBuffer: *mut ::std::os::raw::c_void,
            nFrameBufferSize: u32,
            pFrameHeader: *mut CameraVideoStreamFrameHeader_t,
            nFrameHeaderSize: u32,
        ) -> EVRTrackedCameraError,
    >,
    pub GetVideoStreamTextureSize: ::std::option::Option<
        unsafe extern "C" fn(
            nDeviceIndex: TrackedDeviceIndex_t,
            eFrameType: EVRTrackedCameraFrameType,
            pTextureBounds: *mut VRTextureBounds_t,
            pnWidth: *mut u32,
            pnHeight: *mut u32,
        ) -> EVRTrackedCameraError,
    >,
    pub GetVideoStreamTextureD3D11: ::std::option::Option<
        unsafe extern "C" fn(
            hTrackedCamera: TrackedCameraHandle_t,
            eFrameType: EVRTrackedCameraFrameType,
            pD3D11DeviceOrResource: *mut ::std::os::raw::c_void,
            ppD3D11ShaderResourceView: *mut *mut ::std::os::raw::c_void,
            pFrameHeader: *mut CameraVideoStreamFrameHeader_t,
            nFrameHeaderSize: u32,
        ) -> EVRTrackedCameraError,
    >,
    pub GetVideoStreamTextureGL: ::std::option::Option<
        unsafe extern "C" fn(
            hTrackedCamera: TrackedCameraHandle_t,
            eFrameType: EVRTrackedCameraFrameType,
            pglTextureId: *mut glUInt_t,
            pFrameHeader: *mut CameraVideoStreamFrameHeader_t,
            nFrameHeaderSize: u32,
        ) -> EVRTrackedCameraError,
    >,
    pub ReleaseVideoStreamTextureGL: ::std::option::Option<
        unsafe extern "C" fn(
            hTrackedCamera: TrackedCameraHandle_t,
            glTextureId: glUInt_t,
        ) -> EVRTrackedCameraError,
    >,
}
#[test]
fn bindgen_test_layout_VR_IVRTrackedCamera_FnTable() {
    assert_eq!(
        ::std::mem::size_of::<VR_IVRTrackedCamera_FnTable>(),
        96usize,
        concat!("Size of: ", stringify!(VR_IVRTrackedCamera_FnTable))
    );
    assert_eq!(
        ::std::mem::align_of::<VR_IVRTrackedCamera_FnTable>(),
        8usize,
        concat!("Alignment of ", stringify!(VR_IVRTrackedCamera_FnTable))
    );
    fn test_field_GetCameraErrorNameFromEnum() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetCameraErrorNameFromEnum) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(GetCameraErrorNameFromEnum)
            )
        );
    }
    test_field_GetCameraErrorNameFromEnum();
    fn test_field_HasCamera() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).HasCamera) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(HasCamera)
            )
        );
    }
    test_field_HasCamera();
    fn test_field_GetCameraFrameSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetCameraFrameSize) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(GetCameraFrameSize)
            )
        );
    }
    test_field_GetCameraFrameSize();
    fn test_field_GetCameraIntrinsics() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetCameraIntrinsics) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(GetCameraIntrinsics)
            )
        );
    }
    test_field_GetCameraIntrinsics();
    fn test_field_GetCameraProjection() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetCameraProjection) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(GetCameraProjection)
            )
        );
    }
    test_field_GetCameraProjection();
    fn test_field_AcquireVideoStreamingService() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AcquireVideoStreamingService) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(AcquireVideoStreamingService)
            )
        );
    }
    test_field_AcquireVideoStreamingService();
    fn test_field_ReleaseVideoStreamingService() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseVideoStreamingService) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(ReleaseVideoStreamingService)
            )
        );
    }
    test_field_ReleaseVideoStreamingService();
    fn test_field_GetVideoStreamFrameBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetVideoStreamFrameBuffer) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(GetVideoStreamFrameBuffer)
            )
        );
    }
    test_field_GetVideoStreamFrameBuffer();
    fn test_field_GetVideoStreamTextureSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetVideoStreamTextureSize) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(GetVideoStreamTextureSize)
            )
        );
    }
    test_field_GetVideoStreamTextureSize();
    fn test_field_GetVideoStreamTextureD3D11() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetVideoStreamTextureD3D11) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(GetVideoStreamTextureD3D11)
            )
        );
    }
    test_field_GetVideoStreamTextureD3D11();
    fn test_field_GetVideoStreamTextureGL() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetVideoStreamTextureGL) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(GetVideoStreamTextureGL)
            )
        );
    }
    test_field_GetVideoStreamTextureGL();
    fn test_field_ReleaseVideoStreamTextureGL() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VR_IVRTrackedCamera_FnTable>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseVideoStreamTextureGL) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(VR_IVRTrackedCamera_FnTable),
                "::",
                stringify!(ReleaseVideoStreamTextureGL)
            )
        );
    }
    test_field_ReleaseVideoStreamTextureGL();
}
#[repr(C)]
